{"pages":[{"title":"About","text":"Hello, I’m Meng. I am pursuing a master’s degree in Electronic Information Engineering. I am more interested in self-learning, thanks to the Internet – I am learning everything related to Computer Science, from hardware to software. I also enjoy art films and various books that help me think. It’s a vast and unpredictable world and many things amaze me …… I want to know, why the world is real? What am I experiencing? How is my thinking changing when I, who claimed to worship freedom and embrace revolution, touch my own uncharted territory? So I am blogging to record my learning and insights, and also to unfold my self slowly. I feel as if the blog is a digital river in front of me, which can either flow downstream or backtrack to the pathway place. Although it is still just a small stream, I hope it will flow for a long time. Find me on GitHub, LinkedIn or send me an e-mail.","link":"/about/index.html"},{"title":"Categories","text":"","link":"/categories/index.html"},{"title":"Links","text":"CS FreeCodeCampDeveloper RoadmapsOI WikiCTF WikiVerilog Learning: HDLbitLinux 101 Math Statistics Visualization Learning Site Useful GitHub Trends: OSS Insightsummerschoolsineurope Language 出口日語 E-book Anna’s ArchiveLibrary GenesisZlibraryzhelper search","link":"/links/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"Adaptive Filters","text":"I watched a well organized and concise YouTube video about adaptive filters, which is the focus of an important course I am taking this semester, Digital Signal Processing II. Limitations of fixed-coefficient digital filters Fixed-coefficient digital filters FIR, IIR LP, HP, etc Limitations Time-varying noise-frequency Overlapping bands of signal and noise Adaptive filters 2 main components Digital filter (with adjustable coefficients) Adaptive algorithm 2 input signals: $y_k$ and $x_k$ $y_k = s_k + n_k$ $s_k$ = desired signal $n_k$ = noise $x_k$ = contaminating signal which is correlated with $n_k$, gives an estimate of $n_k$, i.e. $\\hat{n_k}$ Goal: produce optimum $\\hat{n_k}$ $e_k = \\hat{s_k} = y_k - \\hat{n_k} = s_k + n_k - \\hat{n_k}$ Theorem: minimize $e_k$, maximize the signal-to-noise ratio LMS algorithm Wiener filter An input signal w(n) is convolved w ith the Wiener filter g(n) and the result is compared to a reference signal s(n) to obtain the filtering error e(n) Criterion: MMSE (Minimum Mean Square Error) Minimize $J = E[e(n)^2] = E[(x(n) - s(n))^2] = E[(w(n) * g(n) - s(n))^2]$ J can be used to draw the Error-Performance surface The Least mean squares filter converges to the Wiener filter Wiener-Hopf solutionSet gradient of J of H to zero, deduced that$H_{opt} = R_{xx}^{-1} R_{xs}$ where$R_{xx} = E(X_k X_k^T)$$R_{xs} = E(y_k X_k)$ Requires knowledge of $R_{xx}, R_{xs}$ Matrix inversion is expensive For non-stationary, $H_{opt}$ needs to be computed repeatedly LMS adaptive algorithmVersion 1: $H(n+1) = H(n) + \\mu (- \\nabla(n))$Version 2: $H(n+1) = H(n) + \\frac{1}{2}\\delta (- \\nabla(n))$ then$H(n+1) = H(n) + 2\\mu e(n)X(n)$or $H(n+1) = H(n) + \\delta e(n)X(n)$ where$e(n) = y(n) - H^T(n)X(n)$$\\mu$ and $\\delta$ are step-sizes Based on the steepest descent algorithm (update H(n) along the opposite direction of the gradient): $H(n+1) = H(n) + \\mu (- \\nabla(n))$ Using instantaneous estimates instead of the means (unbiased): $J = E[e(n)^2] = e(n)^2$ $\\nabla(n) = -2\\mu E[e(n)X(n)] = -2\\mu e(n)X(n)$ Step-size determines stablility and rate of convergence If too large, too much fluctuation If too small, convergences too slow Limitations If the noise is non-stationary, the error-performance surface will change rapidly If $x(n)$ is proportional to $y(n)$, signal will be obliterated H(n) never reached the theoretical optimum (fluctuation) Applications Acoustic echo cancellation Cancelling EOG from contaminated EEG and get correct EEG Cancelling maternal ECG and get foetal ECG during labour Appendix YouTube Video Adaptive Filters Course Home Page Digital Signal Processing II","link":"/Adaptive-Filters/"},{"title":"Basic MATLAB (very basic)","text":"I watched an introductory tutorial on LinkedIn Learning in order to write computer assignments in MATLAB (I really forgot it all after not using it for two or three years). General concepts Clear commands clc clears the screen clear myVar deletes variable myVar clear all deletes all variables Create variables Creating a scalar: myScalar = 10 Creating a vector: Row vector: myVector = [4 5 6] Column vector: myVectorCol = [7; 8; 9] Creating a matrix: myMatrix = [4 5 6; 7 8 9; 1 2 3] myMatrix(1, 2) gets 5 myMatrix(2, :) gets all columns which are in row 2 myMatrix(3, 2:3) gets row 3, column 2 and 3 Using “;” at the end of command line means it will suppress (i.e. don’t show) the result Variable classes double (default) format long changes double class to long class double, long, short, single, logical (boolean), etc Cell arraysA matrix which has different kinds of elements myCell = {[1 2 3] [4 5 6 7]; &apos;v1&apos; &apos;v2&apos;} myCell{1, 2} gets [4 5 6 7] Core syntax Script “.m” file Comment: % disp(): display something randi(): random integers To tanspose a matrix: matrix&apos; Matrices Create some standard matrices: zeros(m, n) ones(m, n) randi(m, n) Matrix multiplication Standard multiplication: M1 * M2 Element by element multiplication: M1 .* M2 Division is alike Element by element division: M1 ./ M2 If statements1234567if ... ...elseif ... ...else ...end Switch statements12345678switch ... case ... ... case ... ... otherwise ...end For loops1234567891011% step = 1for i = 1: 10 ...end% step = 2% for i = 1: 2: 10% n =25;% step = 5;% for i = 0: step: n While loops123while ... ...end Programming Set pathIf MATLAB can’t find your scripts or functions or anything else, make sure you have added the path Function Create a function from “Current Folder”, and it’s a .m file Edit the pattern and wirte your function Import dataTo import a CSV file: Copy and paste it to “Current Folder” csvread(&apos;sine.csv&apos;) DebuggingSet breakpoints at little dashes in the left of Editor Performance Preallocate some memory can speed large calculations Use “tik … tok” to count the time Data representations Plot123figure% figure(1)plot(x, y) Add a grid: grid on Make the window fits perfectly to the plot: axis tight Set limits to axis: ylim([-1 1]) Change the color: plot(x, y, &apos;m&apos;) % magenta Change the marker: plot(x, y, &apos;o&apos;) % circle, magenta Plot curves multiple times with different lines: hold on. To end it, use hold off Add annotations: xlabel(), title(), legend() Use close all to close all figures Image Use imread() to import the image file Use image() to plot the image (default square) Use imshow() to plot the image in the correct aspect ratio, and there’s no label on the axis 3D plot12345678x = -2*pi:.5:2*pi;[X, Y] = meshgrid(x);Z = sine(X) + cos(Y);figuresurf(X, Y ,Z)colorbar Simulink A block diagram tool that can be used to build systems and feedback loops, generate code for hardware like FPGAs, etc Appendix TutorialLearning MATLAB","link":"/Basic-MATLAB/"},{"title":"Dec 2022","text":"This month was supposed to be the month of exams, so I dedicated my time to reviewing the three main lessons in school: Digital Signal Processing, Digital Image Analysis and Combinatorial Mathematics. I made some notes (all in Chinese), and bookmarked some nice links. Review Notes DSP notes on Notion or on GitHub (some MATLAB code) DIA notes on Google Drive (updating…) Combinatorial Mathematics notes on Google Drive (updating…) Another thing worth mentioning is that this month ChatGPT went viral! I also tried it. It’s amazing I have to say. Here are some interesting or useful links I saw about ChatGPT. Awesome ChatGPT Official Introduction awesome-chatgptThere are many trending repos related to ChatGPT recently. ChatGPT available in mainland China Guide to registering an OpenAI account in China to try ChatGPT Virtual number for receiving SMS online First Experience of ChatGPT ChatGPT Chinese VSCode plugin Hand sketching in Jupyter Notebook, and turning it into code Other Interesting Pages Telegram Guide fernwanderweg.blogspot.comHe used Google blogger to bulid a blog. Looks good. The last three are several top repositories with the great number of stars on GitHub. I was surprised to find that 996.icu was in top 3 . LanguagesUnfortunately I didn’t take the IELTS . I wasn’t ready… I’ll do it later!As for learning Japanese, I dont’t use Duolinguo anymore since it’s a bit simple. I found some YouTube videos to watch and learn, like 出口日語. BlogI changed the theme of my blog from Cactus to Ascent. By the way, here’s my stars list about blog themes.I tried to edit a theme to fit my purpose but failed. Frontend is so difficult!","link":"/Dec-2022/"},{"title":"Creating Packages in Allegro PCB Editor","text":"Take the production of regular shaped SMD (Surface Mounted Devices) as an example. Making pads Check the package parameters in the datasheets; Open Pad Designer and create a new pad file (.pad); Set the pad parameters Parameters: Set “Units” and “Decimal places”. Generally, the maximum precision is 2 when the unit is “mils”, and 4 when the unit is “millimeter”. Layers: To make surface pads, you need to check the “Single layer mode” and set three layers: BEGIN_LAYER; SOLDERMASK_TOP (indicating that this part is not painted with green oil when making the board, thus giving the pads a window to ensure that the pads are exposed and are actually allowed to solder the area); PASTEMASK_TOP (indicating that this area should be coated with solder when soldering) parameters. Note that SMD does not need to fill in the “Thermal Relief” and “Anti Pad”. Generally, the parameters of “PASTEMASK_TOP” are the same as “BEGIN_LAYER”, and “SOLDERMASK_TOP” is 0.1mm larger than the previous two. Making packages Placing pads Open PCB Editor and select “Package symbol” in “Drawing Type” then create a new package file (.dra); Modify the size of grids appropriately; Add the pad file directory: Setup - User Preferences - Catagories - Paths - Library - add the above pad directory to padpath, psmpath, devpath; Add pad pins: Layout - Pins - Select Connect - Select pads from Padstack. Drawing packagesThe package includes (bolded red is mandatory, italic is highly recommended) At least one pin (i.e. pads); Graphic border (i.e. Assembly_Top subclass and Silkscreen_Top subclass of the Package Geometry class), indicating pin 1; Reference number (i.e. at least one subclass of the Ref Des class, usually using the Silkscreen_Top subclass and sometimes drawing the Assembly_Top subclass in passing), placed near the package; Installation Area (i.e. Place_Bound_Top subclass in the Package Geometry class). After saving the file, you will get a .dra file (drawing file, which can be opened to edit the package); a .psm file (data file, which cannot be edited directly, but is necessary when importing the netlist in the .brd file). Note that Draw the outer frame for assembly on “Assembly_Top”; Draw the silkscreen pattern on “Silkscreen_Top”; Draw the area without electrical rules to prevent overlapping of devices on “Place_Bound_Top”; It is highly recommended to put pads, vias and device package files (.dra and .psm) in the same folder. Importing Creating a board Open PCB Editor, select “Board” in “Drawing Type”, create a new board file (.brd), and set the page size and grid point size; Draw the outer frame of the PCB: Add - Line, select “Board Geometry” in class, select “Outline” in subclass; Draw the allowed wiring areas “Route Keepin”: Setup - Areas - Route Keepin. It is recommended that it is 30~40mil from the outer frame; Draw the area “Package Keepin” where the device is allowed to be placed: Edit - Z-copy - Size: Contract - Offset: 1. Generally, indent the “Package Keepin” by 1mil than the “Route Keepin”; Place the mounting holes and make them tangent to the frame of the “Package Keepin”. Setting the structureTake a 4-layer board as an example, from top to bottom are TOP (top alignment layer); GND (ground copper plane); POWER (power layer copper plane); BOTTOM (bottom alignment layer). Setup - Cross-section - add the middle layer; Set the type of each layer (CONDUCTOR for the alignment layer, DIELECTRIC for the media layer, PLANE for the copper plane of power layer and ground layer); Name each layer; Set the positive and negative piece (the alignment layer is positive, that is, the drawing is the part to be kept; the copper plane is negative, that is, the drawing is the part to be discarded). Laying copper in the inner electric layersWith “Route Keepin” drawn, you can use Z-copy to lay copper on the inner layer. At this point, the copper laying of the inner electrical layer is only temporary, just in order to facilitate the subsequent wiring to see if the over-hole is too close. Like the adjustment of the outer frame of the board, the copper plane of the inner layer will be readjusted (i.e., copper re-laying) when the layout wiring is determined. Select “GND” or “POWER” (respectively for the GND layer and POWER layer copper laying) in “Options”, select “Create dynamic shape” (to prevent short circuit); Set GND layer “Offset” to 0, POWER layer “Offset” to 40mil (the power layer needs to be indented 40 mil from the ground layer to reduce the outward radiation from the edge of the plate); Select “Shapes” in “Find”; Turn off the rest of the internal electrical layer display in “Visibility” (so that when laying copper, you can clearly see whether the copper laying is successful). You can also directly lay dynamic copper in the GND layer and POWER layer, and then merge and adjust the shape of copper. Importing the netlistFile - Import - Logic - Design entry CIS (Capture) - Import directory - Import Cadence If a window pops up, modify it according to the error report and then re-import; no window pops up means the import is successful.","link":"/Creating-Packages-in-Allegro-PCB-Editor/"},{"title":"Drawing Schematics in OrCAD Capture CIS","text":"I started drawing PCBs for a project. Firstly, I’m learning to draw schematics using OrCAD Capture CIS. Here are some basic concepts and operations. Project Create new project Modify schematic preferences Modify schematic description Library Create new library Modify library storage location Part Create new part in library Place part Modify part properties Modify footprint View entire part Batch modify pin properties Snap to grid Package Homogeneous: each module of the composite package has the same function Each module is distinguished by the letter after the question mark, such as “U?A” and “U?B” After drawing “U?A”, switch to the next part “U?B”, which has already been drawn automatically, only the pin numbers are left blank The shortcut for switching to the previous part is “Ctrl+B”, and the shortcut for switching to the next part is “Ctrl+N” For a part, if it can be represented by one diagram, then the part cannot have two pins with the same pin number and pin name. However, if the part is divided into many parts to draw, the pin numbers and pin names between the parts can be the same, and the pins with the same pin number and pin name are connected Heterogeneous: each module of the composite package has a different function After drawing “U?A”, switch to the next part “U?B”, which is blank If there are two or more composite packages placed in a schematic to avoid errors when indexing with “Annotate”, a new attribute should be added to the part (the name cannot be “group”), and each part will be divided into different groups according to whether the value of the new attribute is the same. This can determine which parts are in the same chip. Adding parts to schematic Rotate parts Parts not in the library: power, ground Cadence’s built-in library: Cadence - SPB_16.6 - tools - capture - library Generally commonly used capacitors, resistors, inductors, transformers, etc. are in Discrete.olb Design Cache Pin connection 3 types of connections: wire, net alias, bus Wire shortcut key W The lines in the schematic are horizontal and vertical by default. To draw at any angle, press the Shift key and click the start and end points of the line at the same time When two lines intersect, if the intersection is an endpoint of one of the lines, the two lines are electrically connected and the electrical connection cannot be canceled. If the intersection is not an endpoint, there is no electrical connection by default Place junction to add electrical connection to the intersection Place net alias for interconnection within the same page Place off-page connector for interconnection between pages Place no connect for floating pins Do not connect two pins of two parts directly (after connecting the two pins of the two parts, pull them apart, and a line will appear between the two pins) Bus connection Bus naming BaseName[0:all] There cannot be a space between BaseName and [ 32-bit bus ED is represented as ED[0:31] BaseName cannot end with a number The colon “:” in the brackets can be replaced with a hyphen “-“ or two dots “..” Bus entry naming BaseName0 BaseName1 BaseName2… Interconnection between the bus and the signal line must be through the bus entry, and the naming must be consistent through net alias Shortcut key F4 for quick wiring Browsing and searching Browse parts Reset all parts references to “?” and incremental reference update through Tools - Annotate - Packaging - Action Browse nets Browse off-page connectors Browse DRC markers If there are errors that have been corrected, the DRC markers need to be updated synchronously Individual schematic can also be browsed by selecting it Search Replacement and update Differences between the two Replacement can change the connection relationship between the schematic and the library, that is, replace the part in the original library with the part in another library, while update cannot If the new part has a different packaging form from the original part, such as the original part’s packaging form is “Homogeneous”, and the new part’s packaging form is “Heterogeneous”, then to replace the new part’s packaging form with the original part’s packaging form, only replacement can be used, and “Action” must be selected as “Replace schematic part properties”: Cleanup Cache to remove non-existent copies of parts Operating objects in schematic Select multiple objects at the same time Move object The object can be directly dragged, and the connection relationship between the object and other objects remains unchanged Press and hold Alt while dragging, the connection relationship between the object and other objects will be disconnected After disconnection, can the object be reconnected through contact Options - Preferences - Miscellaneous - Wire Drag: Allow parts move with connectivity changes Rotate object R Copy, paste, delete Select the object, hold down the Ctrl key to drag, and the object dragged out is the copied object Mirror object H V Adding footprints Modify the package information of a single part in the schematic Modify the package information of a single part in thelibrary, update to the schematic - open the edit page of a part - Options - Package Properties - PCB Footprint - OK, and finally Replace (not Update) Batch modify part package information Batch modify the package information of all parts on a schematic page Check whether the part package information is missing Generating netlist Check the logical function and electrical connection of the schematic before generating, re-index the entire project, and perform DRC check Post-processing Generate nestlist Print schematic","link":"/Drawing-Schematics-in-OrCAD-Capture-CIS/"},{"title":"Feb 2023","text":"School has started. Although I finished organizing my notes before the exams, I still walked out of the exam room in pain. So far I only have a DSP score, 78, and I feel like I did worse on the remaining two classes that haven’t come out yet, so I don’t know how bad it will be …… Discovery this month 類 Wandering DoubanAfter being gravedigged, deleted and banned for a week by Douban for no reason, I angrily searched for alternative apps. Here are a few options. Tagging books, movies and music: NeoDB See this post for how to use it. Combined with Doufen, you can migrate all the data over.You can also mark those banned entries on NeoDB. Tagging movies: Letterboxed Tagging books: Goodreads This blog “Douban Escape Plan“ talks about how to migrate data to Notion I didn’t try it, but it looks very detailed and feasible. Reviewing digital image analysis, I found two good pages. Traditional CV Algorithms - Edge Detection - Textbook Collection A very comprehensive introduction. SUSAN operator The author of the entry is actually my lecturer (ﾟoﾟ;; Looking through the LUG group chat logs, I found Linux C Programming One-Stop Learning. I also found a Tsinghua teacher’s Internet of Things tutorial when I was reviewing. When I was surfing Twitter, I found a blogger’s weekly report on RisingWave. I don’t understand it but I like the weekly report. In Japanese class, the teacher recommended the website Japanese Culture Center. Progress this month I’ve been watching and collecting internship information (but I haven’t submitted my resume). I continued learning “Linux 101” and Andrew Ng’s Machine Learning videos (other studies are still on hold). I did sports a few times. I started drawing PCB! It’s hard! But it dose not annoying. Let’s start with PCB just like Stephen Chow started with playing a small role! Books and movies  始于极限：女性主义往复书简I have passionately recommended to quite a few people. 我的阴阳两界It helped me get through this somewhat difficult winter holiday. A novel that can be enjoyed is rare. 3 of the 11 movies I watched this month that I recommend the most — The Passengers of the NightÉric Rohmer’s fans really love it! The time to live and the time to diePoignant and true. AftersunAs many people have said, it’s even more impressive after you watch it. Finally, a cool screenshot of Chantal Akerman:","link":"/Feb-2023/"},{"title":"Hello World","text":"I made it! :)","link":"/Hello-World/"},{"title":"Git Learning Notes","text":"I finally went through the tutorial. I learned Git because I wanted to be proficient with GitHub, but now I realize that Git is the core of the deepest mystery  Introduction Git is developed in C Centralized &amp; Distributed Version Control Systems Centralized: the repository is stored on a central server; the biggest problem is that you have to be connected to the Internet to make it work. Distributed: no “central server”, everyone has a complete repository on their computer, no network required; much more secure; usually there is a computer that acts as a “central server”, but this server is only used to facilitate “swapping” everyone’s changes; extremely powerful branch management Creating a repository A repository can be simply understood as a directory in which all files can be managed by Git, and each file’s modifications and deletions can be tracked by Git so that the history can be tracked at any moment, or “restored” at some point in the future. Creating a repository step1: Create an empty directory step2: Initialize, git init. Put a file into the Git repository git add git commit Time machine shuttle git status to see the status of the workspace git diff to see what was changed Version fallback git reset --hard commit_id version fallback git reset --hard HEAD^ In Git, you use HEAD for the current version, the last version is HEAD^, the previous version is HEAD^^, and up to 100 is written as HEAD~100 git reset --hard 1094a It’s not necessary to write the full version number (commit id), the first few bits will do, Git will automatically find it git log to see the commit history show the commit log from most recent to furthest back (if that’s too much, add the -pretty=oneline argument) git reflog to see the command history You can find the version number Working Directory &amp; Stage Working Directory: The directory you can see on your computer Repository: There is a hidden directory .git in the workspace, which is not considered a working directory, but a Git repository. The important things in the repository are Staging area: stage (or index) branches: the first branch master that Git automatically creates for us Pointer: a pointer to master called HEAD. All the changes to the file that need to be committed are put into the staging area, and then all the changes in the staging area are committed at once Managing Changes Git tracks and manages changes, not files. Every time you make a change, if you don’t add it to the staging area with git add, it doesn’t get added to the commit. add only adds to the staging area, commit goes to the repository, and all the same files in the staging area are overwritten. Unding changes git restore -- file discards the changes and puts the file back in the state it was in when you last git commit or git add. -- is important, without --, it becomes a “switch to another branch” command git restore --staged undoes the changes in the staging area and puts them back in the workspace Note. The original git checkout can be replaced with git restore The original git reset HEAD can be replaced with git restore –staged The latest version of the git prompt has been replaced with restore To summarize. Case 1: You made changes in the workspace and didn’t add them to the staging area, so you want to undo the changes in the workspace with git restore file Case 2: You made changes in the workspace and added them to the staging area with git add, but did not commit them; if you want to undo them, there are two steps: 1. Case 3: After making changes in the workspace, and git add git commit adds and commits the content, you want to undo this commit, directly use git reset –hard HEAD^ to roll back the version, which will ensure that the workspace, staging area, and repository are all the same as the last one Deleting files git rm If a file has been committed to the repository, then you never have to worry about deleting it by mistake, but be careful, you can only restore the file to the latest version and you will lose what you have changed since the most recent commit When you delete a useless file directly in the file manager, or with the rm command, you have two options next. Do delete the file from the repository, then use the command git rm to delete it, and git commit If you deleted the wrong file, use git checkout to restore the wrongly deleted file from the repository to the latest version Remote repositories The transfer between the local Git repository and the GitHub repository is encrypted via SSH Adding a remote repository git remote add origin git@server-name:path/repo-name.git When associating a remote repository, you must assign a name to the remote repository, origin is the default convention After the association, use the command git push -u origin master to push all the content of the master branch for the first time After that, you can use the command git push origin master to push the latest changes whenever necessary after each local commit Deleting the remote repository git remote rm &lt;name&gt; Before using it, it is recommended to check the remote repository information with git remote -v It just unbinds the local and remote, it does not physically remove the remote repository. There are no changes to the remote repository itself. To actually delete the remote repository, you need to log in to GitHub and find the delete button on the backend page before deleting it Cloning from a remote repository ssh: git clone git@github.com:your name/repo name.git Faster https: git clone http://github.com/yourname/reponame.git Branch management Creating and merging branches git checkout -b or git switch -c creates and switches Equivalent to git branch (create) + git checkout or git switch (switch) git branch to see the current branch will list all branches, with a * in front of the current branch git merge merges the specified branch into the current branch git branch -d delete branches Creating, merging, and deleting branches is very fast, so it’s best to use a branch to complete a task, merge it, and then delete the branch, which is the same as working directly on the master branch, but a much safer process Resolving conflicts Manually edit the file that failed the Git merge to what we want it to be, and then commit it Branch Management Strategy Branching strategy The master branch should be very stable, i.e. only used for new releases, no work should be done on it. The dev branch is unstable, work is done on the dev branch; at some point, for example, when version 1.0 is released, the dev branch is merged into the master branch and version 1.0 is released on the master branch All team members work on the dev branch, and everyone has their own branch, so just merge it to the dev branch from time to time Normal mode when merging branches: add -no-ff parameter This way the merged history has branches and you can see that a merge was done, while a fast forward merge will not show that a merge was done Bug branch When you fix a bug, you create a new bug branch to fix it, then merge it, and finally delete it git stash saves the worksite, then goes to fix the bug, and after fixing it, there are two ways to get back to the worksite. git stash apply, the stash content is not deleted, you need to use git stash drop to delete it git stash pop, which removes the stash content while restoring it git stash list to see what’s in the stash, then use git stash apply stash@{0} to restore to the specified stash (in this case, stash@{0}) For bugs fixed on the master branch that you want to merge into the current dev branch, you can use git cherry-pick &lt;commit&gt; to “copy” the changes from the bug commit to the current branch to avoid duplication of effort Feature branch To develop a new feature, it is best to create a new branch If you want to discard a branch that has not been merged, you can force it to be deleted with git branch -D &lt;name&gt; Multi-author collaboration git push origin &lt;branch-name&gt; to push your own changes If the push fails, the remote branch is newer than your local branch and you need to try to merge it with git pull first If git pull prompts no tracking information, then you need to use git branch --set-upstream-to &lt;branch-name&gt; origin/&lt;branch-name&gt; to establish a link between the local and remote branches If there is a conflict in the merge, resolve the conflict and commit locally If there is no conflict, or if the conflict is resolved, push with git push origin &lt;branch-name&gt; Rebasing Organize the history of unpushed forked commits locally into straight lines Purpose: To make it easier to see how commit history has changed, since forked commits require a three-way comparison Tag management A tag is a meaningful name that is easy to remember and is tied to a commit If the commit appears in both the master branch and the dev branch, then the tag can be seen on both branches Creating the tag git tag &lt;tagname&gt; creates a new tag The default is HEAD, but you can also specify a commit id Tags created are only stored locally and are not automatically pushed to the remote git tag -a &lt;tagname&gt; -m &quot;blablabla...&quot; Create tags with descriptions git tag to see all tags Instead of listing them chronologically, alphabetize them git show &lt;tagname&gt; to see tag information Manipulating tags Push git push origin &lt;tagname&gt; push a local tag to the remote git push origin --tags push all unpushed local tags to the remote at once Delete git tag -d &lt;tagname&gt; Delete a local tag Delete a remote tag: first from local (with the above command), then from remote with git push origin :refs/tags/&lt;tagname&gt; Using GitHub You can fork any open source repository You have read and write access to the repository after fork Push a pull request to the official repository to contribute code Using Gitee Domestic Git hosting service Similar to GitHub Customizing Git git config --global color.ui **true** Make Git display colors to look more eye-catching Ignoring special files Github official .gitignore file collection Principles of ignoring files. Ignore files automatically generated by the operating system Ignore compile-generated intermediate files, executables, etc. Ignore configuration files with personally sensitive information git add -f filename is ignored but forced to be added !filename exception file .gitignore online generator Configuring aliases -git config --global **alias**.st status sets st to represent status -global is a global parameter for the current user, i.e. it makes the command useful for all Git repositories on this computer; if you don’t add it, then it’s only useful for the current repository Git configuration files for each repository are placed in the .git/config file The current user’s Git configuration file is placed in a hidden file .gitconfig in the user’s home directory To remove an alias, just delete the line after [alias] that corresponds to the alias Setting up a Git server You need a machine running Linux (Ubuntu or Debian is recommended). See here Using Sourcetree Free Git GUI tool Appendix Tutorial Liao Xuefeng’s Git course Links Git Cheat SheetGit Official Website","link":"/Git-Learning-Notes/"},{"title":"Installing Software in Linux","text":"There are 5 ways to install software in Linux. Installation Using the APP storeAvailable for distributions with APP store, such as Ubuntu, Manjaro, etc. In Xubuntu, the APP store is called “Software”, but it doesn’t work well because it loads very slowly. Using package management systemA package management system is a collection of tools that automates the installation, update, configuration and removal of software. In Linux, many software can be installed with a single command, elegantly and quickly. In contrast to the APP store, using the package manager requires that you know in advance the name of the package in the repository where you want to install the software. For example, dpkg, which manages Debian (.deb) packages, and its front-end apt (for Debian distributions). The full name of apt is Advance Package Tool. apt Before installing, use apt search to see if the corresponding package name is in the repository. Once you have determined the package name, install it with apt install package name. Enter Y and enter to confirm the installation. Permission problem Prompt “Permission denied”, “are you root?”. To fix it, add sudo in front of the command, i.e. sudo apt install firefox. When the user inputs a password, the terminal does not display the password back for security reasons. Official software sources The list of software sources for apt is under /etc/apt/sources.list. Third-party sources You can add third-party sources and install the software if it is not in the official sources. After adding third-party sources to /etc/apt/sources.list, you can get the list of third-party software and install the required third-party software with apt install package-name. For example, install Docker by adding the Docker sources 1. Installing packages manually using the package managerIn addition to installing software from official and third-party repositories, you can also directly download and install binary packages such as deb, rpm, etc., packaged by the software vendor, and install them using shell. Try to use apt to install deb, avoid using dpkg -i , because installing deb directly via dpkg will not install the required dependencies. It will only report that the corresponding dependencies are missing, and you need to fix them manually with the following command: 1$ sudo apt -f install For example, install VSCode 2. I tried but failed. First, my Linux distribution was too old to install with apt, so I used dpkg -i and made some errors;Second, I seemed to have insufficient storage space to install the whole VSCode;Finally, I made the mistake of powering off Linux, and when I booted it up again, there was no GUI, only a cursor flashing in the upper left corner. I searched for these problems, but they were not successfully solved. I had no choice but to delete the original virtual machine and add a new one. File transfer between host win10 and virtual machine ubuntu Transferring files via SSH connection to the server 3. I chose MobaXterm and successfully transferred the files. A few little penguins suddenly jumped out when the connection was disconnected ^_^ Installing pre-compiled executablesThe software provider may also provide pre-compiled executables that can be run directly. For example, install a pre-compiled LLVM 4. Using source code 5Update Locally on the computer, the system maintains a list of packages that contains software information and package dependencies. Update the software list Use apt update to get the new software version and software dependencies. Update the software After getting the new software list, use apt upgrade to update the software. Appendix Tutorial Linux 101 - chap 03: 软件安装与文件操作 [1] Linux 101 - 第三方软件源 [2] Visual Studio Code on Linux [3] 宿主机win10与虚拟机ubuntu之间的文件传输方法 [4] Linux 101 - 安装预编译可执行文件 [5] Linux 101 - 使用源代码安装","link":"/Installing-software-in-Linux/"},{"title":"Intro to Git & GitHub","text":"This is some simple notes I took when I was learning the LinkedIn course Learning Git and Github. By the way, I found it very convenient to make notes in Notion first and then export Markdown, modify it, copy and paste it into the Blog. Start12git config --global user.name &quot;name&quot;git config --global user.email &quot;mail&quot; 1git init Staging files12git add filenamegit add . 1git commit -m &quot;message&quot; 1git log Git environments Working Staging Commit File states1git status Tracked (after commit) Unmodified Modified Staged Untracked Restoring files12git restore filenamegit restore . Ignoring files Sensitive info Personal notes System files Use .gitignore file Clearing the cache1git rm -r --cached . Deleting1git rm filename Delete, and move to stage and ready to commit. Renaming1git mv oldname newname Move to stage too. Showing differences1git diff 1got log --oneline Amending1git commit --amend 12git resetgit reset --hard RebasingA time machine. Rewrite the history. 1git rebase Branches1git branch Copying a branch: 1git switch -c NAME Merging: 1git merge &lt;branch&gt; Deleting a branch: 1git branch --delete NAME Git flow: Fix branch Make changes Merge to master Delete old branch Merge conflictsChoose one. Stashing1234git stashgit stash listgit stash applygit stash pop Git clean123git clean -ngit clean -dgit clean -f Github Cloud repository Collaborative dev Projet management Working with github: Set up remote Push Fetch/pull Pushing to githubRemotes: 1234git remote add NAME URLgit remote remove NAMEgit rename OLDNAME NEWNAMEgit remote -v Git push: 123git push REMOTE BRANCHgit push -u origin maingit push --all Github optionsIssuesCollaborate with people Write notes, like to-do items, for youself or others Assign to-do to individuals, and they can comment Pull requestsChange the repo Approve changes that somebody else has made Compare different branches ActionsManage the repo (advanced) Run tests Host code automatically Download other’s actions to use ProjectsManage the repo Kanban board WikiCreate documentation that is easy for people to look at (not really necessary) SecurityManage policies for security (advanced) InsightsKnow contributors, traffic, etc (private) Settings Convert this repo to be a template Github pages Managing projects Contributors Invite a collaborator Issues Labels Milestones Projects Syncing1git clone 1git fetch 1git pull pull = fetch + merge","link":"/Intro-to-Git-GitHub/"},{"title":"Intro to Java","text":"The sections on the background of Java’s birth, development history and version descriptions were very helpful to me. Introduction Founder: James Gosling Java is somewhere between a compiled language and an interpreted language. It compiles code into a kind of “bytecode”, similar to abstract CPU instructions, and then writes virtual machines for different platforms, which are responsible for loading the bytecode and executing it, so that it can be “written once and run everywhere”. Java three versions Java SE: Standard Edition, which contains the standard JVM and standard libraries, and is the core of the entire Java platform Java EE: Enterprise Edition, which is based on Java SE with a large number of APIs and libraries to facilitate the development of Web applications, databases, messaging services, etc.; the virtual machine of Java EE is exactly the same as Java SE; it is necessary for further learning of Web applications Java ME: Micro Edition, a “thin version” for embedded devices, the standard libraries of Java SE cannot be used on Java ME; the virtual machine of Java ME is also a “thin version”; not popular, not Recommended to learn The recommended route to learn Java First learn Java SE, master the Java language itself, Java core development techniques and the use of Java standard libraries. If you continue to learn Java EE, then the Spring Framework, database development, distributed architecture is required to learn. If one wants to learn big data development, then Hadoop, Spark, Flink, these big data platforms are what one needs to learn, they are all based on Java or Scala development. If you want to learn mobile development, then go deep into the Android platform and master Android App development. JDK: Java Development Kit, in addition to containing the JRE, also provides a compiler, debugger and other development tools, used to compile Java source code into Java byte code JRE: Java Runtime Environment, is a virtual machine to run Java byte code JSR specification: Java Specification Request JCP Organization: Java Community Process RI: Reference Implementation, Reference Implementation TCK: Technology Compatibility Kit, compatibility test kit Basics Basic structure of the program123public class Hello { // The class name is Hello // ...} // End of class definition 12345public class Hello { public static void main(String[] args) {// The method name is main// Method code... }// End of method definition} Class names must start with English letters (customary uppercase); method names must start with English letters (customary lowercase) Inside a class, several methods can be defined public is an access modifier that indicates that the class is public. It will compile correctly without public, but the class will not be executed from the command line The method specified by the Java entry program must be a static method, the method name must be `mainand the arguments in parentheses must be String arrays Intelli IDEA code formatting: Ctrl + Alt + L Variables and Data Types Two types of variables: basic types and reference types Basic types are types that the CPU can perform operations on directly. They include integer, floating point, boolean, and character types The rest are reference types, which are similar to pointers in C. They store an internal “address” that points to the location of an object in memory. The most common type is String Variables of basic types “hold” a value, while those of reference types “point” to an object Constants cannot be reassigned after initialization Abbreviating variable types, using the var keyword Arithmetic Integer operations are always exact, floating point operations are often not Process control Inputs and Outputs Output System.out.println(), output with line feed System.out.print(), output without line break System.out.printf(), formatted output Input (cannot be run online, must be read from the command line) 1234567import java.util.Scanner;public class Main {publicstaticvoid main(String[] args) { Scanner scanner =new Scanner(System.in);// Creating a Scanner object String name = scanner.nextLine();// Read a line of input and get the string int age = scanner.nextInt();// Read a line of input and get the integer }} If condition judgment It is not reliable to use = to determine the equality of floating point numbers, the correct way is to use the difference is less than a certain threshold value to determine To determine whether the contents of variables of reference types are equal, you must use the equals() method Case multiple selection Always write default Starting from Java12, the new syntax uses -&gt; and if there are multiple statements, they need to be enclosed in {}. Don’t write break statements, because the new syntax will only execute the matching statement, there is no penetration effect Inside a switch expression, use yield to return a value as the return value of the switch statement While loop Judgment first, then loop Possible loop 0 times Do while loop Loop first and judge later Loop at least once For loop May loop 0 times Break and continue In a multi-layer nested loop, both can only jump out of the loop they are in Array operations Traversal, sorting, multidimensional arrays, command line arguments (omitted) Appendix Tutorial Liao Xuefeng’s Java course - Java Quick Start","link":"/Intro-to-Java/"},{"title":"Jan 2023","text":"In the first month of the new year, I was still organizing review notes at tortoise speed and feeling lazy. But I also learned something new. Changed blog theme againI changed blog theme to Minos in order to add the English and Chinese language options, and finally succeeded after some tinkering! And for my own aesthetic, I slightly modified the appearance. Then I found that when I clicked on the cell phone to change the language, the drop-down menu was blocked by the navigation bar. I thought of various solutions, and finally the complete display was achieved by changing the layout, so I organized it into a GitHub repository for Chinese users to use directly. . Then I found a problem again: after opening the navigation bar for articles in the config, when you read articles, the English version displayed the subheadings normally, but the Chinese was garbled. This legacy problem has not been solved yet, so for the time being, I changed it to this: English version has the navigation bar, while no such thing in Chinese version . Using LinuxI found a great tutorial: Linux 101, which was written by the Linux community at USTC. Successfully used Linux and passionately sent an email to join the community and see the genius guys in it! I currently finished learning the first three chapters. About machine learningI went back to Andrew Ng’s Machine Learning videos and left freecodecamp 藍. Freecodecamp’s tutorials are very practical, knocking the code directly, but it’s too fast, while Andrew Ng is just the opposite. Well, I think if you are not in a hurry, it’s better to watch Andrew Ng’s videos first to understand the principles. Currently I just finished “P92 16.3 Integration”. When reviewing DIA, I found an article that explains the BP algorithm. I saw a post on machine learning concepts. Started drawing the PCBTo be precise, I just started to draw the schematic. I’ve only used Altium Designer before, but now I need to use Cadence, and I checked the difference between the two, it seems that Altium Designer is easy to get started and has limited performance, while Cadence is more difficult and powerful. I also saw a good blog: Cadence usage and drawing board skills related. Didn’t learn the languageBut I got a Japanese class for next semester! Niceヽ(✿ﾟ▽ﾟ)ノ","link":"/Jan-2023/"},{"title":"Intro to Linux","text":"I have successfully installed and used Xubuntu according to the tutorial! Great! Explosive growth in computer performance Moore’s Law: The number of transistors that can fit on an integrated circuit doubles every two years/computer performance doubles every 18 months (Intel CEO David House) The limits of quantum physics and the limitations of CPU power consumption and heat dissipation are starting to slow down the increase in computer performance. Joint collaboration between multiple CPUs (multi-core based development) is the way forward instead of pursuing individual CPU performance gains Operating system The bridge between the user and the underlying hardware Functions Process management: the operating system schedules processes so that many processes can execute concurrently on several central processors Memory management: the operating system allocates and reclaims memory appropriately File system: the operating system creates appropriate data structures to store files and data Network communication: the operating system implements various necessary network communication methods (e.g. TCP/IP) Security mechanisms: the operating system is equipped with security mechanisms to protect data from unauthorized access User Interface: Operating systems usually include a graphical user interface to facilitate the use of the computer by the user Drivers: The operating system interfaces with drivers to perform the functions of the hardware Linux was born The choice of Linux is largely a recognition of the geek spirit and open source culture. Free software means that the software’s users have freedom. (The issue is not about price.) We developed the GNU operating system so that users can have freedom in their computing. Specifically, free software means users have the four essential freedoms: (0) to run the program, (1) to study and change the program in source code form, (2) to redistribute exact copies, and (3) to distribute modified versions. Software differs from material objects—such as chairs, sandwiches, and gasoline—in that it can be copied and changed much more easily. These facilities are why software is useful; we believe a program’s users should be free to take advantage of them, not solely its developer.1 In 1983, Richard Stallman launched the GNU Project at MIT; in 1991, Linus Torvalds wrote and released the Linux kernel, which became the basis for all subsequent Linux distributions GNU: GNU is a recursive abbreviation for “GNU is Not Unix”, which refers to a UNIX-like but completely free operating system GNU General Public License (GNU GPL or GPL): grants all rights to use the software under this license to anyone who uses it This right is also known as copyleft, as opposed to the usual copyright The core GNU operating system has not been developed to date. What is actually used now is GNU/Linux, where the Linux kernel is the functional core and the GNU components are peripherals and tools for the user to operate and use the Linux kernel A common system on smartphones today is Android/Linux, an operating system based on the Linux kernel that does not use GNU components, but rather a different Android system developed by Google as a tool Linux distributions Linux distribution = Linux kernel + a set of GNU tools and libraries, some accompanying software, documentation, a desktop system, a window manager, and a desktop environment Mainstream distribution branches ****Debian branch ****: The most famous one is Ubuntu, an operating system that focuses on desktop applications and is suitable for general users. It is recommended that first-time Linux users give preference to the Ubuntu distribution or its sub-distributions (Lubuntu, Xubuntu, etc.) ****Red Hat branch ****: Fedora, CentOS (suitable for running on servers that require high stability) ****Arch Linux branch ****: requires users to be willing to understand how the OS works themselves, and does not take the approach of shielding how it works to lower the barrier to use. Variant Manjaro is more focused on ease of use and more suitable for general users Linux on the side Smartphones: The Android operating system developed by Google is part of the Android/Linux branch, also called Android native, with many sub-distributions, such as Huawei EMUI and Xiaomi MIUI, etc. Servers: Websites and software providers need to set up their own computers to perform computing, storage and communication functions, and such computers are called servers. Servers usually do not use personal computer operating systems like Windows or macOS, but mostly use Linux distributions because of their simple interfaces, powerful features, and the fact that some distributions are also supported by the services of professional computer companies (such as RHEL). debian and Ubuntu Server are very popular Embedded devices: Various distributions under the Android/Linux branch are the mainstream embedded operating systems, such as Google’s Android TV operating system for digital TV Using Linux It is recommended to use a virtual machine to run the installed Linux image Steps Get the virtual machine management software, VMware Workstation Player is recommended Get Xubuntu virtual machine image (Xubuntu is a sub-distribution of Ubuntu, very similar to Ubuntu, but smaller and less performance intensive, suitable for computers with different performance) ) Double click to open the virtual machine image, the management software will open and import the image, you can directly click the start button to start after the import is complete 拾 ~ Appendix Tutorial Linux 101 - chap 01: 初识 Linux Citation [1] Philosophy of the GNU Project Recommended Reading Why Open Source Misses the Point of Free Software","link":"/Intro-to-Linux/"},{"title":"LaTeX CV","text":"From noon yesterday to noon today, I was working on latex to make a resume. That’s very unfriendly for beginners . Luckily I finished it now! Take a look at my CV. Here’s how I did it: -&gt; If you only use latex occasionally or a few times, an onilne editor Overleaf can save you lots of troubles. You can find templates, edit and compile them.-&gt; If you want to do more things, use following steps: Download MiKTeX and VSCodeMiKTeXYou will get MiKTeX Consle and TeXworks. The latter is an editor but I prefer to use VSCode because it can preview pdf at another window (also because I already have VSCode).Another choose is Tex Live. It comes with a full package pre-installed, but the download is too slow and often fails so I chose MiKTeX. VSCodeRemember to download extension latex workshop. Find a templateOn Overleaf or Github.Here are my favorites:新卒のためのLaTeX履歴書テンプレートTLC-Resume-2021And mine:Resume-CV (based on TLC-Resume-2021) Edit the templateYou may encounter many problems at this step, most of which require you to download Packages in MiKTeX Console, or other stuff like Perl. Just install the missing items as stated in the error message. Share your template Git your template to github(Already bound git and your github accounts and set SSH key)-&gt; Create a new repository-&gt; Git bash the folder which contains full files about your template-&gt; Run the following code in Git: git init git add . git commit -m &apos;Description&apos; git remote add origin https://... (copy from github) git push -u origin master Submit to OverleafThat’s where I found the original template for my CV! I think put templates there may help more people.","link":"/Latex-CV/"},{"title":"My First LinkedIn Certificate!","text":"Yeah I got it ! I have been dreaming of online learning certificates, like coursera and linkedin, for a long time. Coursera’s free plan is a week, while linkedin’s is a month so I chose the latter. (Note that for Chinese mainland users, you must change your location to Non-mainland China in your account settings to get a monthly free plan. Also you must use a Visa credit card.) Nice course Short, less than 2 hours, which is very newbie-friendly.Practical! The author introduced many useful websites for learning and developing. What I have learned Types of web development jobsFor planning and prototyping: UX (User Experience) UI (User Interface) For coding and developing: Front-end Dev (Javascript, CSS, HTML; frameworks) Back-end Dev Javascript, CSS, HTML HTML identifies structural elements. CSS changes the appearance and style. JS handles the interactivity, like moving and animation. A little knowledge of GithubThat’s beyond my expectation, and just what I need! Looks like Github Pages Service is a good (means free) start for small and simple web dev. I’ll hands on it lately. No-codeIt’s a fresh new concept to me. Sounds interesting that you can develop a web without coding. But maybe the price is, the real cost – money? But it’s limited, especially when you know more and get greedy :p Useful tools Prototying tools: Figma Graphic design tools: Illustrator, Photoshop (professional) Affinity, Figma (lighter) Canva (simplest, free plan, templates) Coding editors: CodePen (online, free plan) VS Code Atom (free, highly customizable) Brackets Web host: Github Pages Service (simplest, free) No-code tools CMSs (Content Management System): Joomla! Drupal Wordpress Website builders: Squarespace, Wix, Weebly (simple) Webflow, Editor X (complex) Databases: Google Sheets Airtable Apps: Bubble (web) AppGyver (web, ios, android) Adalo, Glide (ios, android) At last, here’s my certificate and I’d like to get more in the future  ~ Appendix LinkedIn Learning Course Introducation to Web Design and Development","link":"/My-first-LinkedIn-certificate/"},{"title":"Object-oriented","text":"The three basic features of object-oriented are: encapsulation, inheritance, and polymorphism. Class &amp; Instance Class is an object template, instance is an object instance Define class (contains multiple fields, field) 1234class Person { public String name; public int age;} Create instance (variables that point to instance are reference variables) 1Person ming = new Person(); Access instance variables with Variable. Field A Java source file can contain multiple class definitions, but only one public class can be defined, and the public class name must match the file name. If you want to define multiple public classes, you must split them into multiple Java source files Method Motivation: To avoid external code to access field directly, we can modify field with private to deny external access, and then use method to allow external code to modify field indirectly Inside the method, we have the opportunity to check if the parameters are correct; external code does not have any opportunity to set the field to an unreasonable value By defining methods, a class can expose to external code the interface for some operations, while ensuring internal logic consistency The syntax for calling a method is Instance variable. Method name (parameter); Defining methods 123456789// modifier method return type method name (list of method parameters) {// Several method statements;// return method return value;// }// If there is no return value and the return type is set to void, return can be omittedpublic String getName() { return this.name;} private methods: external calls are not allowed, only the inside of the class can be called this variable: Inside the method, you can use an implicit variable this, which always points to the current instance. The fields of the current instance can be accessed through this.field. If there is no naming conflict, this can be omitted; if local variables and fields are renamed, this must be added Method parameters: 0 or any of them, used to receive the value of the variable passed to the method Variable parameters: type..., equivalent to an array type Variable parameters ensure that null cannot be passed in Parameter binding The passing of a basic type parameter is a copy of the caller’s value. Each side’s subsequent modifications do not affect each other With reference type arguments, the caller’s variable and the receiver’s argument variable point to the same object. Any modification of this object by either side affects the other (because it points to the same object) Construction method 123456789101112131415161718192021222324public class Main { public static void main(String[] args) { Person p = new Person(&quot;Xiao Ming&quot;, 15); }}class Person { private String name; private int age; // Construction method public Person(String name, int age) { this.name = name; this.age = age; } public String getName() { return this.name; } public int getAge() { return this.age; }} When an instance is created, the new operator calls its corresponding constructor method, which is used to initialize the instance The instance is actually created by the constructor method to initialize the instance The name of the constructor method is the class name. There is no restriction on the parameters of the constructor method, and you can write any statement inside the method. However, compared to normal methods, constructor methods do not have a return value (nor void), and to call a constructor method, you must use new. If no constructor method is defined, the compiler will automatically create a default constructor method with no parameters. When fields are not initialized in the constructor method, the default value is null for fields of reference types, 0 for fields of numeric types, and 0 for int types. and the default value for boolean types is false. Multi-construction methods Multiple constructors can be defined, and the compiler will automatically determine them based on the parameters. You can call another constructor inside a constructor method for easy code reuse. Overload 123456789101112// The String class provides several overloaded methods indexof()public class Main { public static void main(String[] args) { String s = &quot;Test string&quot;; int n1 = s.indexOf(&apos;t&apos;); int n2 = s.indexOf(&quot;st&quot;); int n3 = s.indexOf(&quot;st&quot;, 4); System.out.println(n1); System.out.println(n2); System.out.println(n3); }} Meaning: Method overloading refers to multiple methods with the same method name but different parameters. Function: Methods with similar functions use the same name, which is easier to remember and simpler to call. The return value type of method overloading is usually the same Inheritance 123456789101112131415161718class Person { private String name; private int age; public String getName() {...} public void setName(String name) {...} public int getAge() {...} public void setAge(int age) {...}}class Student extends Person { // Do not duplicate the name and age fields/methods, // only need to define new score fields/methods private int score; public int getScore() { … } public void setScore(int score) { … }} Function: Reuse code Use the extends keyword to implement inheritance Inheritance tree: for classes that do not explicitly write extends, the compiler will automatically add extends Object. Any class, except Object, inherits from some class A class has one and only one parent class. Only Object is special, it has no parent Subclasses can’t access the parent’s private, they can access the parent’s protected. If the parent class does not have a default constructor, the subclass must explicitly call super() with arguments in order for the compiler to locate a suitable constructor for the parent class The subclass does not inherit any of the parent’s constructor methods. The default constructor of a subclass is automatically generated by the compiler and is not inherited Blocking Inheritance1234public sealed class Shape permits Rect, Circle, Triangle { ...}// The above Shape class allows only 3 specified classes (Rect, Circle, Triangle) to inherit from it From Java 15, use -sealed to modify the class and explicitly write the names of subclasses that can inherit from the class via -permits sealed is currently in preview state, to enable it, you must use the parameters -enable-preview and -source 15 Upcasting1Person p = new Student(); Safely transforming a subtype into a more abstract parent type For example, if the inheritance tree is Student &gt; Person &gt; Object, then you can transform the Student type to Person, or to a higher level Object Downcasting12345Person p = new Student();if (p instanceof Student) { // Downcasting only if judged successful Student s = (Student) p; // It will work!} It will probably fail. To avoid errors, use instanceof to first determine whether an instance is of a certain type or not Starting from Java 14, after determining instanceof, you can directly transform to the specified variable and use it directly to avoid forcing transformation again Inheritance &amp; Combination Inheritance is an “is” relationship and combination is a “has” relationship Polymorphism 12345678910111213class Person { public void run() { … }}class Student extends Person { @Override public void run() { … }}class Teacher extends Person { @Override public void run() { … }} Meaning: method calls for a certain type, where the actual method executed depends on the actual type of method at runtime Function: Allows adding more types of subclasses to extend the functionality without modifying the code based on the parent class Override Subclasses can override the methods of the parent class. The override changes the behavior of the parent class methods in the subclass. Adding @Override allows the compiler to help check if the override is done correctly. If you want to call the overridden method of the parent class in the overriding method of the subclass, you can do so with super. final final-modified methods can be prevented from being overridden A class modified by final prevents inheritance. final-modified fields must be initialized when the object is created and cannot be modified subsequently Abstract Class 123abstract class Person { public abstract void run();} Motivation: If the method of the parent class itself does not need to achieve any function, only to define the method signature, the purpose is to allow subclasses to override it, then the method of the parent class can be declared as an abstract method, itself does not achieve any method statement Meaning: If a class defines a method, but no concrete implementation code, the method is an abstract method, abstract methods are modified with abstract; because the abstract method can not be implemented, so the class must also be declared as an abstract class (abstract class) abstract class can not be instantiated Function: The abstract class can force subclasses to implement its defined abstract methods, otherwise the compilation will report an error. It is equivalent to defining a “specification” Abstract-oriented programming Upper level code only defines the specification Business logic can be implemented without subclasses (normal compilation) The specific business logic is implemented by different subclasses and the caller does not care Interface 1234interface Person { void run(); String getName();} Motivation: If an abstract class has no fields and all methods are all abstract methods, you can rewrite the abstract class as an interface An interface is a purely abstract interface that is more abstract than an abstract class, because it cannot even have fields Declare an interface using interface. When a concrete class implements an interface, the implements keyword is used; a class can implement more than one interface. Interfaces are also data types, and are suitable for both upward and downward transitions Interface Inheritance12345678interface Hello { void hello();}interface Person extends Hello { void run(); String getName();} Using extends Inheritance relationship The public logic fits in the abstract class, the concrete logic is placed in each subclass, and the interface level represents the level of abstraction The object instantiated can only ever be a concrete subclass, but always refer to it through the interface, because interfaces are more abstract than abstract classes Default method Interfaces can define default methods Motivation: When we need to add a new method to an interface, it will involve modifying all the subclasses. If the new method is a default method, then the subclasses do not need to be modified, but only need to override the new method where it is needed. The difference between default method and abstract class ordinary method: because interface has no fields, so default method can not access the fields, while the abstract class ordinary method can access the instance fields Static Fields &amp; Static Methods Static Fields Fields modified with static are called static fields Instance Fields &amp; Static Fields Instance fields have their own separate “space” in each instance, and fields of the same name in each instance do not affect each other Static fields have only one shared “space”, which is shared by all instances It is not recommended to use `instance variables. Static fields’ to access static fields, it is recommended to use class names to access static fields Static fields can be interpreted as fields describing the class itself (not instance fields) Static methods Methods that are modified with static are called static methods Instance Methods &amp; Static Methods To call an instance method, you must pass an instance variable. To call a static method, you don’t need an instance variable, you can call it by the class name. Static methods are similar to functions in other programming languages Static methods do not require an instance and cannot access this, but they can access static fields and other static methods Static methods are often used in tool classes (e.g. Arrays.sort(), Math.random()) and auxiliary methods (e.g. the entry point of a Java program, main(), is a static method) Static fields for interfaces interface can have static fields, and the static fields must be of type `final Since interface fields can only be of type public static final, these modifiers can be removed Package 1234package ming; // Affirmation of package name mingpublic class Person {} When defining a class, you need to declare in the first line which package the class belongs to A class always belongs to a package (package), the class name (e.g. Person) is just a shorthand, the real full class name is package name. Class name As long as the package name is different, the class is different Packages can be multi-layer structures, separated by . separated by Packages have no inheritance relationship class without package name defined is the default package, very easy to cause name conflicts, not recommended to not write package name Package Scope123456789101112131415package hello;public class Person { // Package Scope void hello() { System.out.println(&quot;Hello!&quot;); }}public class Main { public static void main(String[] args) { Person p = new Person(); p.hello(); // Can be called, because Main and Person are in the same package }} Classes located in the same package can access the fields and methods of the package scope Fields and methods that are not modified by public, protected, or private are package scoped import1234567891011// Person.javapackage ming;// Import the full class nameimport mr.jun.Arrays;public class Person { public void run() { Arrays arrays = new Arrays(); }} The core classes of the JDK use the java.lang package, which is automatically imported by the compiler Other common classes of the JDK are defined in java.util.*, java.math.*, java.text.*, …… Scope public class, interface defined as public can be accessed by any other class field, method defined as public can be accessed by other classes, provided that they have access to class first If you’re not sure whether you need public, don’t declare it as public, i.e. expose as few fields and methods as possible to the public A .java file can contain only one public class, but can contain multiple non-public classes. If there is a public class, the file name must be the same as the name of the public class private field, method defined as private cannot be accessed by other classes Access to private is restricted to the interior of class and is independent of the order of method declarations ***. It is recommended to put private methods later Nested classes have access to private. protected Acts on inheritance relationships. Fields and methods defined as protected can be accessed by subclasses, as well as subclasses of subclasses pakage Package scope means that a class is allowed to access class without public, private modifier of the same package, as well as fields and methods without public, protected, private modifier Defining methods as package permissions helps to test Local Variables Variables that are defined inside a method are called local variables The scope of a local variable starts at the point where the variable is declared and ends at the corresponding block Method parameters are also local variables The scope of local variables should be kept as small as possible, and local variables should be declared as late as possible. final Use final to prevent inheritance, overwriting by subclasses, and reassignment Nested Class Inner Class123456789101112131415public class Main { public static void main(String[] args) { Outer outer = new Outer(&quot;Nested&quot;); // Instantiate an Outer Outer.Inner inner = outer.new Inner(); // Instantiate an Inner inner.hello(); }}class Outer { ... class Inner { // Define an Inner Class ... }} An instance of Inner Class cannot exist alone, it must be attached to an instance of Outer Class To instantiate an Inner, you must first create an instance of Outer, and then, call new on the Outer instance to create the Inner instance Inner Class can modify the private field of the Outer Class The Outer class is compiled as Outer.class, while the Inner class is compiled as Outer$Inner.class Anonymous Class123Runnable r = new Runnable() { // Implement the necessary abstract methods...}; Another way to define an Inner Class. It is not necessary to define this Class explicitly in Outer Class Motivation: Because we don’t care about the class name here, we can write much less code than defining the Inner Class directly. Anonymous classes can also access the private fields and methods of the Outer Class Anonymous classes are compiled as Outer$1.class, Outer$2.class, Outer$3.class … In addition to interfaces, anonymous classes can also inherit from ordinary classes Inner Class and Anonymous Class are essentially the same, both must depend on an instance of Outer Class, i.e., they implicitly hold an instance of Outer.this and have private access to Outer Class Static Nested Class No longer attached to an instance of Outer, but a completely separate class, so it cannot refer to Outer.this, but can access Outer‘s private static fields and static methods Static Nested Class is a separate class, but has private access to Outer Class Classpath and jar The JVM determines the path and order of searching for class through the environment variable classpath. Setting the system environment variable classpath is not recommended, it is always recommended to pass in the -cp command. The jar package is equivalent to a directory, and can contain many .class files for easy download and use Class version A higher version of the JDK can compile and output a lower version compatible class file, and vice versa may report an error Which JDK version is used at runtime, try to use the same version to compile the source code when compiling Modules The .class file is the smallest executable file seen by the JVM, and a large program needs to write many Classes and generate a bunch of .class files. The jar file is the container for the class files, for ease of management. It does not care about the dependencies between `classes Since Java 9, modules have been introduced, and the class container with its own “dependencies” is the module, which is identified by the .jmod extension Only the java.base module does not depend on any module and is the “root module” Wrapping a bunch of classes into a jar is just a packaging process, while wrapping a bunch of classes into a module requires not only packaging, but also writing dependencies, and can contain binary code (usually JNI extensions) and support multiple versions The role of modules: declare and manage dependencies; further isolate access to code Appendix Tutorial Liao Xuefeng’s Java course - Object-oriented Foundation","link":"/Object-oriented/"},{"title":"Nov 2022","text":"LeetcodeSolved 64 problems on Leetcode till now. Finished the Explore Arrays 101 (the remaining one was only available for Premium). It’s very easy even for beginners like me. Got a badge! To be honest, I didn’t quite understand all the data structures in the badge 洛. I’m just familiar with arrays and strings… I plan to find time to digest the other structures, and make a sum-up. Jupyter NotebookHanded on it. I wrote a simple notebook about the process of using Logistic Regression model to classify some datas. Github WorkflowUsed Metrics in the homepage of my github account. It’s amazing for it can update automatically! LinkedIn Learning CertificatesI will give my rating for that course under each certificate. ⭐⭐⭐⭐⭐ ⭐⭐ ⭐⭐ ⭐⭐⭐⭐ ⭐⭐⭐ EnglishPreparing for the IELTS indicator exam. Kept on learning Japanese on Duolinguo for 42 days. I found out that there were only two Japanese language tests in China, JLPT and JTEST. JLPT is held only two times every year, and it’s often cancelled. JTEST is held more frequently, but it’s not as highly acknowledged as JLPT so I’m hesitant to prepare for it.","link":"/Nov-2022/"},{"title":"Oct 2022","text":"ProgrammingI finished 27 problems on Leetcode till now, and all used Java. The last explore chapter Array and String was a bit difficult, but the current one Arrays 101 is much easier. Why I’m still doing arrays? I can’t wait to deal with something new. I learnt a little of the famous course, CS61A, and did HW 01, HW 02, Lab 00, Lab 01, and I’m in Lab 02 now. I studied more seriously in the first half of the month, and slacked off in the second half. I hope I can persevere and finish this course and CS61B. The OK system is very interesting. I watched some Andrew Ng’s Machine Learning videos, from the beginning to P48 “Inference: making predictions”. My mentor asked me to learn machine learning so I was trying to get started. I also read some parts of the the classic tutorial book, Hands on Machine Learning. That’s nice, and more codes and more difficult that the videos. However, I still didn’t understand ML well. It seems easy but to do it is really hard勞. The good news was that I made a python program this afternoon finally… Matlab looked convenient, but it required too much computer performance and was a bit unstable. I was thinking of the characteristics of data… LanguageInsisted on watching one English video a day, especially the Economist. I also read an article named Prince in the section “Briefing”. And I began to preparing for Duolinguo English Test several days ago. My boyfriend signed up for IELTS(indicator). We all will take exams next week. Hope we all succeed! I also began to lean Japanese from Duolinguo and NHK Easy Japanese. Love this website for its simpleness. I didn’t know Japanese had tenses too. Bye for now! It’s midnight.","link":"/Oct-2022/"},{"title":"Operating Files in Linux","text":"Linux manipulates files via the command line, including viewing, editing, copying, moving, deleting, creating, searching, matching, compressing, and uncompressing files, and it’s important to learn how to use the documentation. Viewing cat 12$ # Output the entire contents of the FILE file$ cat [OPTION] FILE cat is short for concat*enate. The actual function of the cat utility is to concatenate multiple files and then output them. When there is only one file, cat will output that file directly, so the most common use of cat is to output a single file. less 12$ # Output the contents of a FILE file in an interactive window$ less FILE cat prints the entire contents to the terminal at once and exits, while less displays one page at a time and supports forward/backward scrolling, searching, etc. If you want to find a part of a large file, less is usually much more convenient than cat. Similar commands to less: more, most. Editing Nano is a command-line text editor that comes with many machines and is more novice-friendly than vim and emacs. 1$ nano FILE # Use nano to edit FILE files Copying 123456789$ # Copy the SOURCE file to the DEST file, the resulting file is DEST$ cp [OPTION] SOURCE DEST$ # Copy the SOURCE file to the DIRECTORY directory, SOURCE can be more than one file$ cp [OPTION] SOURCE... DIRECTORY$ # e.g.$ cp file1 file3 # Make a copy of file1 to the same directory as file3$ cp file1 file2 . /file/ # Copy file1, file2 files to the file directory in the same directory$ cp -r file . /test/ # Copy the file folder and all its subfiles to the test folder in the same directory Hard links and soft links Hard links have the same inode as the source file and both point to the same location on disk. Deleting one of them does not affect the other. Soft links have a different inode than the source file. Soft links save the path to the source file, and when accessing a soft link, the accessed path is replaced with the path to the source file, so accessing a soft link is also equivalent to accessing the source file. However, if the source file is deleted, the path saved by the soft link is invalid, and the soft link is therefore invalid as well1. Moving 12345$ # Move the SOURCE file to the DEST file$ mv [OPTION] SOURCE DEST$ # Move SOURCE file to DIRECTORY directory, SOURCE can be multiple files$ mv [OPTION] SOURCE... DIRECTORY Similar to “cut” in Windows. Deleting 123456789$ # Delete FILE files, FILE can be multiple files.$ # If you need to delete a directory, you need to delete it recursively with the -r option$ rm [OPTION] FILE...$ # e.g.$ rm file1 # Delete the file1 file$ rm -r test/ # Delete the test directory and all files under it$ rm -rf test1/ test2/ file1.txt # Delete the files, directories test1/, test2/, file1.txt. Among them, these files or directories may not exist, be write-protected, or not have permission to read or write Creating Creating directories 123456$ # Create a directory named DIR_NAME$ mkdir [OPTION] DIR_NAME...$ # e.g.$ mkdir test1 test2 # Create two directories with the names test1, test2$ mkdir -p test1/test2/test3/ # Create path test1/test2/test3/ Creating files 12$ # Create a file named FILE_NAME$ touch FILE_NAME... The stat command displays information about a file’s attributes. What touch actually does is modify the access time (atime) and modification time (mtime) of the file, which can be treated as touching the file, causing its access and modification times to change. When the file does not exist, touch creates a new file. Searching 1234567$ # Search for files in PATH based on EXPRESSION$ find [OPTION] PATH [EXPRESSION]$ # e.g.$ find . -name &apos;report.pdf&apos; # Search for a file named report.pdf in the current directory$ find / -size +1G # Search for files larger than 1G on the whole disk$ find ~/ -name &apos;node_modules&apos; -type d # Search for all folders named node_modules in the user directory Pattern matching The matching pattern for bash is called glob. 123$ # e.g.$ rm *.tar.gz # Remove all compressed files ending in tar.gz$ mv -r *. [ch] /path # Move all code ending in .c or .h in the current and subdirectories to /path Be sure to make sure you type correctly before using wildcards, otherwise serious consequences may occur (e.g. rm -rf * will delete all files in the current directory). Compressing and uncompressing Using tar to archive and compress files 1234567$ # The command format is as follows, please refer to the following sample usage to understand how to use$ tar [OPTIONS] FILE...$ # e.g.$ tar -c -f target.tar file1 file2 file3 # Package file1, file2, file3 as target.tar$ tar -x -f target.tar -C test/ # Extract the files in target.tar to the test directory$ tar -cz -f target.tar.gz file1 file2 file3 # Pack file1, file2, file3 and compress them using gzip to get the compressed file target.tar.gz As with most Linux commands, the tar command can combine parameters. For example, the following command is equivalent: 123$ tar -c -z -v -f target.tar test/$ tar -czvf target.tar test/$ tar -f target.tar -czv test/ The suffix name does not determine the file type, but it can help one to identify the possible file types of this file and thus choose the appropriate opening method. Documentation man commands 123$ # Call up the documentation for the tar and ls commands$ man tar$ man ls It shows the meaning of each parameter of the software, the meaning of the exit value, the author, etc. It is large and comprehensive. But generally less with the use of sample, you need to splice the software parameters according to their own needs, not conducive to quickly get started. tldr A few simple examples allow users to quickly understand how to use the software. 1$ tldr COMMAND Note that if this error is reported: 1mkdir:Unable to create directory &quot;/home/lzy/.tldr&quot;: file already exists The solution is: 1234$ sudo apt-get update$ sudo apt-get install tldr$ mkdir -p ~/.tldr/tldr$ sudo git clone https://github.com/tldr-pages/tldr.git ~/.tldr/tldr Appendix Linux 101 - chap 03: 软件安装与文件操作 [1] 阮一峰的网络日志 - 理解inode","link":"/Operating-Files-in-Linux/"},{"title":"Shell","text":"The Matrix effect is so cool. What is shell Shell is a program in Linux that accepts commands from the keyboard, hands them over to the system for execution, and returns the output of the command to the user Almost all Linux distributions provide a shell program called Bash, which is an “enhanced” version of the traditional shell Note that Windows paths are separated by a backslash \\; UNIX-like paths are separated by a forward slash /; UNIX-like systems also do not use the disk mechanism under Windows, but use a unified root directory Absolute paths &amp; relative paths 123/bin/ls # Absolute paths. /file.txt # Relative path, file.txt file in current directory... /file.txt # Relative path, file.txt file in the previous directory (parent directory) $ and # $ at the beginning of the command means that the command is run with normal user privileges # means that the command requires root privileges (the highest privilege), which is generally equivalent to $ sudo the command # at the end of the command means that the symbol and its contents are comments 123456$ A commandThe output of the command# Commands that require root privileges$ # Comments Why use shell Efficiency Once you are familiar with the command line and have an auto-completion shell program, you can save a lot of time by using the command line 1$ mv ... /source/file.txt ... /dest/ # Drag file.txt from the . /source/ folder to the . /dest/ folder Automation Scripts Automates repetitive tasks Save resources The vast majority of servers do not use a graphical interface in order to save resources Advanced system maintenance tasks Some advanced systems do not have a graphical interface and maintenance tasks can only be done from the command line; or complex configuration files need to be written by hand Looks cool! A simulation of The Matrix effects: Open the terminal emulator Install cmatrix 1$ sudo apt install cmatrix Use the cmatrix command to see the effects Press the q key or Ctrl + C to exit Simple shell commands ls: lists the contents of the (list) directory cd: change directory (change directory) pwd: View the current directory (print working directory) Appendix Tutorial Linux 101 - 第二章：个性化配置与建站体验","link":"/Shell/"},{"title":"Process","text":"A process is a program that is running. When you start a program, the operating system first reads the program file from the hard disk, then loads the program contents into memory, and finally the CPU executes the program. This is a process. Basic concepts of Process Checking processeshtop ps (process status) ps shows only the relevant processes running in this terminal. ps aux shows all processes. PID (process identifier)The PID is a number that uniquely identifies a process. The PID can be used as an index when hanging, continuing or terminating a process. Process priorityNI (nice) The range of values is -20 to 19. Usually the NI value of the currently running process is 0. The higher the NI, the lower the priority. Specify the priority: 12$ nice -n 10 vim # Run vim with a nice value of 10$ renice -n 10 -p 12345 # Set the nice value of the process with PID 12345 to 10 To lower the nice value you need sudo. PRI (priority) Normally PRI = nice + 20. If the PRI value is RT, or if it is negative, the corresponding process has higher real-time requirements (e.g. kernel processes, audio-related processes, etc.). Process statusRoughly divided into: Running Ready Blocked Detailed classification: State Abbreviation Description Running R Running/ready to run immediately Sleeping S Interruptible sleep Disk Sleep D Non-interruptible sleep Traced / Stopped T Traced / Suspended processes Zombie Z Zombie processes Process Control SignalSignal is a mechanism for processes to communicate with each other on Unix family systems. The Linux command that sends signals is called kill. Use man 7 signal to see the list of signals. Switching from front to backBy default, commands run in the shell are run in the foreground. If you need to run in the background, you need to add &amp; to the end of the command. If you need to switch the foreground program to the background, you need to press Ctrl + Z to send SIGTSTP to hang the process and return control to the shell. 1$ bg %2 # Put process 2 into the background Terminating a processThe standard signal to terminate a process is SIGTERM, which implies the natural death of a process. Sending the signal in htop Press K, select the desired signal in the left prompt bar and press enter to send it. Kill 12$ kill -l # Show all signals$ kill -9 PID # 9 for SIGKILL. End process PID immediately If you don’t add any arguments, only PID, kill will automatically use 15 (SIGTERM) as signal argument. Kill-like commands 1$ apropos kill # Show various other kill-like commands Get out of the terminalnohup Once a terminal is closed, it sends a SIGHUP (Signal Hangup) to each process in it, and the default action for SIGHUP is to quit the program running. By adding nohup before the program that needs to block SIGHUP, the runtime output will be redirected to nohup.out (which can also be customized). tmux“tmux” is a split-screen, command-line emulated terminal that runs on the command line. It can integrate multiple interactive processes in a single window and does not disappear when disconnected or temporarily logged out, but is stored in the background and can be restored immediately when logging in next time. “tmux” is divided into three parts: Session: to distinguish different jobs; Window: different pages of the session in terms of displays; Pane: different areas of the window divided by white lines. To install and open tmux: 12$ sudo apt install tmux$ tmux Shortcut keys (Ctrl + B first) Function % Left/right split screen “ Up and down split screen ↑ ↓ ← → The focus switches to the top, bottom, left, and right pane, and the pane being interacted with is selected in green. d (detach) Detach from tmux and return to the command line interface. z (zoom) Temporarily fullscreen the pane, and press again to restore it to its original state c Create a new window , Name the window s List all sessions If you are disconnected, use tmux attach [-t window name] to reconnect the window when you log in again. Without -t, the last opened window will be connected by default. Customizing tmux Service DaemonThe only way to avoid disappearing due to terminal shutdown is to disconnect from the session at startup. Such processes, which work silently in the background, are called daemons. Service managementThe init scheme for most Linux distributions is systemd, whose command for managing system services is systemctl. Use the systemctl status command to see what services are running on the system. Use systemctl list-units to see the status of all systemd managed services. Use tldr to view the commands for starting, terminating, and reloading configuration of services. Customizing servicesWrite a .service configuration file and run it. Routine tasksRefers to the implementation of periodic scheduled tasks. The main ones in Linux are at and crontab. at at is responsible for single scheduled tasks. Installation: 1$ sudo apt install at Use tldr to see how to use it. crontab crontab is responsible for periodic tasks. Unlike at, crontab is mostly implemented through configuration files. To see the usage of crontab: 1$ crontab --help Configuration format: The first half of each line is the time, and the second half is the shell execution command. # minutes hour day month week | command # Example * * * * * echo &quot;hello&quot; &gt;&gt; ~/count # Output hello every minute to count file in home directory 0,15,30,45 0-6 * jan sun command # Do something randomly every Sunday in January every year for 15 minutes from 0:00 midnight to 6:00 am The crontab.guru website can translate the configuration file into an easy-to-understand representation. Appendix Reference Tutorial Linux 101 - chap 04: 进程、前后台、服务与例行性任务 Recommended Reading 进程和线程 - 廖雪峰的官方网站 进程、线程基础知识 - 小林coding 进程的概念 &amp; 组成 &amp; 特征","link":"/Process/"},{"title":"Two-pointer","text":"In this October, I was trying to force myself to do one Leetcode problem per day. Although I missed some days, I finally finished my first “Explore”. The biggest lesson for me is an amazing technique called Two-pointer. At first I thought it’s nested two for-loops, but then I found it’s actually much more flesxible and useful. So I’d like to note it. Meaning Use two pointers at the same time to do the iteration. Application When you want to iterate the array from two ends to the middle, you can use one pointer starts from the beginning while the other pointer starts from the end. They have same steps. 123456789101112131415// Reverse Stringclass Solution { public void reverseString(char[] s) { int i = 0; int j = s.length - 1; while (i &lt; j) { char temp = s[i]; s[i] = s[j]; s[j] = temp; i++; j--; } }} 12345678910111213141516171819202122// Two Sum II - Input array is sorted// Given a 1-indexed array of integers numbers that is already sorted in non-decreasing order, find two numbers such that they add up to a specific target numberclass Solution { public int[] twoSum(int[] numbers, int target) { int[] res = new int[2]; int start = 0; int end = numbers.length - 1; while (start &lt; end) { if (numbers[start] + numbers[end] == target) { break; } else if (numbers[start] + numbers[end] &lt; target) { start ++; } else { end --; } } res[0] = start + 1; res[1] = end + 1; return res; }} When you want one slow-runner and one fast-runner at the same time, you can use one pointer for the iteration while another one for the special position. They have different steps. 123456789101112131415// Remove Element// &quot;i&quot; for iteration and &quot;k&quot; for the elements to removeclass Solution { public int removeElement(int[] nums, int val) { int k = 0; for (int i = 0; i &lt; nums.length; i++) { if (nums[i] != val) { nums[k] = nums[i]; k++; } } return k; }} Here an important concept is introduced: in-place. An in-place algorithm is an algorithm which transforms input using no auxiliary data structure. However, a small amount of extra storage space is allowed for auxiliary variables. The input is usually overwritten by the output as the algorithm executes. An in-place algorithm updates its input sequence only through replacement or swapping of elements.1 123456789101112131415161718// Max Consecutive Ones// &quot;i&quot; for iteration and &quot;max&quot; for finding the max numberclass Solution { public int findMaxConsecutiveOnes(int[] nums) { int max = 0; int sum = 0; for (int i = 0; i &lt; nums.length; i++) { sum += nums[i]; if (nums[i] == 0) { sum = 0; } else { max = Math.max(sum, max); } } return max; }} 12345678910111213141516// Remove Duplicates from Sorted Array// &quot;i&quot; for iteration and &quot;j&quot; for the unique elementsclass Solution { public int removeDuplicates(int[] nums) { int n = nums.length; int j = 0; for (int i = 1; i &lt; n; i++) { if (nums[j] != nums[i]) { j++; nums[j] = nums[i]; } } return j + 1; }} 1234567891011121314151617181920// Move Zeroes// &quot;i&quot; for iteration and &quot;k&quot; works on the non-zero elementsclass Solution { public void moveZeroes(int[] nums) { int n = nums.length; int k = 0; for (int i = 0; i &lt; n; i++) { k = i; if (nums[i] == 0) { if (k &lt; n-1) { while (nums[k] == 0 &amp;&amp; k &lt; n-1) {k++; } int temp = nums[i]; nums[i] = nums[k]; nums[k] = temp; } } } }} My current progress:Congrats to myself and keep it up!  Appendix LeetCode Explore Array and String Citation [1] Wikipedia: In-place algorithm","link":"/Two-pointer/"}],"tags":[{"name":"DSP","slug":"DSP","link":"/tags/DSP/"},{"name":"MATLAB","slug":"MATLAB","link":"/tags/MATLAB/"},{"name":"Cadence","slug":"Cadence","link":"/tags/Cadence/"},{"name":"Git","slug":"Git","link":"/tags/Git/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"GitHub","slug":"GitHub","link":"/tags/GitHub/"},{"name":"Java","slug":"Java","link":"/tags/Java/"},{"name":"LaTeX","slug":"LaTeX","link":"/tags/LaTeX/"},{"name":"Front-end","slug":"前端","link":"/tags/%E5%89%8D%E7%AB%AF/"},{"name":"Data Structure & Algorithm","slug":"数据结构与算法","link":"/tags/%E6%95%B0%E6%8D%AE%E7%BB%93%E6%9E%84%E4%B8%8E%E7%AE%97%E6%B3%95/"}],"categories":[{"name":"Learning","slug":"学习","link":"/categories/%E5%AD%A6%E4%B9%A0/"},{"name":"Summary","slug":"总结","link":"/categories/%E6%80%BB%E7%BB%93/"},{"name":"Job","slug":"工作","link":"/categories/%E5%B7%A5%E4%BD%9C/"},{"name":"LeetCode","slug":"LeetCode","link":"/categories/LeetCode/"}]}