<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>STCF MDC FEE 设计 - Meng&#39;s Blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">


<link href="/Design-of-STCF-MDC-FEE/" rel="alternate" hreflang="en" />
    


<meta name="description" content="Go forward. Don't look back. ">





    <meta name="description" content="&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x8BFE;&amp;#x7A0B;&amp;#x8BBA;&amp;#x6587;&amp;#xFF0C;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;&amp;#x8D85;&amp;#x7EA7;&amp;#x9676;&amp;#x7CB2;&amp;#x88C5;&amp;#x7F6E;&amp;#x4E3B;&amp;#x6F02;&amp;#x79FB;">
<meta property="og:type" content="article">
<meta property="og:title" content="STCF MDC FEE 设计">
<meta property="og:url" content="https://mengisok.github.io/zh-cn/Design-of-STCF-MDC-FEE/index.html">
<meta property="og:site_name" content="Meng&#39;s Blog">
<meta property="og:description" content="&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x8BFE;&amp;#x7A0B;&amp;#x8BBA;&amp;#x6587;&amp;#xFF0C;&amp;#x8BE6;&amp;#x7EC6;&amp;#x4ECB;&amp;#x7ECD;&amp;#x4E86;&amp;#x8D85;&amp;#x7EA7;&amp;#x9676;&amp;#x7CB2;&amp;#x88C5;&amp;#x7F6E;&amp;#x4E3B;&amp;#x6F02;&amp;#x79FB;">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://mengisok.github.io/images/overall_layout_of_STCF.png">
<meta property="og:image" content="https://mengisok.github.io/images/components_of_STCF_detector.png">
<meta property="og:image" content="https://mengisok.github.io/images/components_of_electronics_for_particle_physics_experiments.png">
<meta property="og:image" content="https://mengisok.github.io/images/STCF_MDC_readout_electronics_system_architecture.png">
<meta property="og:image" content="https://mengisok.github.io/images/structure_of_FEE.png">
<meta property="og:image" content="https://mengisok.github.io/images/circuit_model_in_LTspice.png">
<meta property="og:image" content="https://mengisok.github.io/images/daughterboard_and_motherboard_structure_for_FEE.png">
<meta property="og:image" content="https://mengisok.github.io/images/STCF_MDC_FEE_PCB.png">
<meta property="article:published_time" content="2023-10-15T15:58:19.000Z">
<meta property="article:modified_time" content="2023-10-23T13:53:35.122Z">
<meta property="article:author" content="Han Meng">
<meta property="article:tag" content="物理电子学">
<meta property="article:tag" content="读出电子学">
<meta property="article:tag" content="STCF项目">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://mengisok.github.io/images/overall_layout_of_STCF.png">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


<meta name="generator" content="Hexo 6.3.0">
<style>.github-emoji { position: relative; display: inline-block; width: 1.2em; min-height: 1.2em; overflow: hidden; vertical-align: top; color: transparent; }  .github-emoji > span { position: relative; z-index: 10; }  .github-emoji img, .github-emoji .fancybox { margin: 0 !important; padding: 0 !important; border: none !important; outline: none !important; text-decoration: none !important; user-select: none !important; cursor: auto !important; }  .github-emoji img { height: 1.2em !important; width: 1.2em !important; position: absolute !important; left: 50% !important; top: 50% !important; transform: translate(-50%, -50%) !important; user-select: none !important; cursor: auto !important; } .github-emoji-fallback { color: inherit; } .github-emoji-fallback img { opacity: 0 !important; }</style>
</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/zh-cn">
                
                    
                    Meng&#39;s blog
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/zh-cn/archives">归档</a>
            
            <a class="navbar-item "
               href="/zh-cn/categories">分类</a>
            
            <a class="navbar-item "
               href="/zh-cn/tags">标签</a>
            
            <a class="navbar-item "
               href="/zh-cn/links">链接</a>
            
            <a class="navbar-item "
               href="/zh-cn/about">关于</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu" style="top:100%">
            <div class="dropdown-content">
            
                <a href="/Design-of-STCF-MDC-FEE/" class="dropdown-item">
                    English
                </a>
            
                <a href="/zh-cn/Design-of-STCF-MDC-FEE/" class="dropdown-item">
                    简体中文
                </a>
            
            </div>
        </div>
    </div>
</div>

            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" target="_blank" rel="noopener" href="https://github.com/mengisok">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            STCF MDC FEE 设计
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            
                <span>10月 15 2023</span>
            
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/zh-cn/categories/%E5%AE%9E%E9%AA%8C%E5%AE%A4%E5%B7%A5%E4%BD%9C/">实验室工作</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            33 分钟 读完 (约 4967 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p>&#x8FD9;&#x662F;&#x6211;&#x7684;&#x4E00;&#x7BC7;&#x8BFE;&#x7A0B;&#x8BBA;&#x6587;&#xFF0C;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x8D85;&#x7EA7;&#x9676;&#x7CB2;&#x88C5;&#x7F6E;&#x4E3B;&#x6F02;&#x79FB;&#x5BA4;&#x7684;&#x524D;&#x7AEF;&#x7535;&#x5B50;&#x5B66;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<span id="more"></span>
<p>&#xFF08;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x548C;&#x683C;&#x5F0F;&#x7ECF;&#x8FC7;&#x4FEE;&#x6539;&#xFF0C;&#x4E0D;&#x62D8;&#x6CE5;&#x4E8E;&#x8BBA;&#x6587;&#x683C;&#x5F0F;&#xFF0C;&#x4EE5;&#x4FBF;&#x9605;&#x8BFB;&#x3002;&#xFF09;</p>
<h2 id="&#x6458;&#x8981;">&#x6458;&#x8981;</h2>
<hr>
<p><strong>&#x8D85;&#x7EA7;&#x9676;&#x7CB2;&#x88C5;&#x7F6E;(Super Tau-Charm Facility&#xFF0C;STCF)</strong> &#x662F;&#x4E2D;&#x56FD;&#x8BA1;&#x5212;&#x5EFA;&#x8BBE;&#x7684;&#x65B0;&#x4E00;&#x4EE3;&#x7684;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x5BF9;&#x649E;&#x673A;&#xFF0C;&#x662F;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x5317;&#x4EAC;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x5BF9;&#x649E;&#x673A;(Beijing Electron Positron Collider II, BEPC II)&#x53CA;&#x5176;&#x914D;&#x5957;&#x7684;&#x5317;&#x4EAC;&#x8C31;&#x4EEA;(Beijing Spectrometer BES III)&#x9879;&#x76EE;&#x7684;&#x5EF6;&#x7EED;&#xFF0C;&#x4E13;&#x95E8;&#x5BF9;&#x3C4;&#x7CB2;&#x80FD;&#x533A;&#x8FDB;&#x884C;&#x7269;&#x7406;&#x7814;&#x7A76;&#x3002;</p>
<p><strong>&#x4E3B;&#x6F02;&#x79FB;&#x5BA4;(Main Drift Chamber, MDC)</strong> &#x662F;STCF&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x4E3B;&#x8981;&#x5B50;&#x63A2;&#x6D4B;&#x5668;&#x4E4B;&#x4E00;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x7EC8;&#x6001;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x5F84;&#x8FF9;&#x3001;&#x52A8;&#x91CF;&#x7684;&#x6D4B;&#x91CF;&#x548C;&#x7C92;&#x5B50;&#x9274;&#x522B;&#x3002;&#x63A2;&#x6D4B;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x5FAE;&#x5F31;&#x7684;&#x6A21;&#x62DF;&#x7535;&#x4FE1;&#x53F7;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x4E00;&#x5957;<strong>&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;(Readout Electronics)</strong> &#x7CFB;&#x7EDF;&#x52A0;&#x4EE5;&#x5904;&#x7406;&#xFF0C;&#x5C06;&#x5176;&#x8C03;&#x7406;&#x653E;&#x5927;&#x5E76;&#x8F6C;&#x5316;&#x6210;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#xFF0C;&#x5F62;&#x6210;&#x80FD;&#x591F;&#x53CD;&#x6620;&#x7C92;&#x5B50;&#x7279;&#x6027;&#x7684;&#x4E8B;&#x4F8B;&#x6570;&#x636E;&#xFF0C;&#x4F9B;&#x6570;&#x636E;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;(Data Acquisition System&#xFF0C;DAQ)&#x91CD;&#x5EFA;&#x7269;&#x7406;&#x4E8B;&#x4F8B;&#x548C;&#x8BB0;&#x5F55;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x8FDB;&#x884C;&#x79BB;&#x7EBF;&#x5206;&#x6790;&#x3002;</p>
<p>&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x4E86;STCF MDC&#x524D;&#x7AEF;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x539F;&#x578B;&#x7535;&#x8DEF;&#x9A8C;&#x8BC1;&#x677F;&#x7684;&#x6574;&#x4F53;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x7684;&#x521D;&#x6B65;&#x8BBE;&#x8BA1;&#x3002;MDC&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x65B9;&#x6848;&#x5305;&#x542B;<strong>&#x524D;&#x7AEF;&#x7535;&#x5B50;&#x5B66;(Front End Electronics, FEE)&#x6A21;&#x5757;</strong>&#x548C;<strong>&#x8BFB;&#x51FA;(Readout Unit, RU)&#x6A21;&#x5757;</strong>&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x548C;&#x6570;&#x5B57;&#x6BCD;&#x677F;&#x3002;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E3A;16&#x901A;&#x9053;&#xFF0C;&#x5B50;&#x677F;&#x5355;&#x677F;&#x4E0A;&#x6709;2&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x6BCF;2&#x4E2A;&#x5B50;&#x677F;&#x548C;1&#x4E2A;&#x6BCD;&#x677F;&#x76F8;&#x8FDE;&#x63A5;&#x3002;&#x5B50;&#x677F;&#x5305;&#x542B;&#x4E86;TIA&#x4E0E;ADC&#x9A71;&#x52A8;&#x5668;&#x7535;&#x8DEF;&#x3001;&#x6807;&#x5B9A;&#x7535;&#x8DEF;&#x3001;&#x7535;&#x6E90;&#x7535;&#x8DEF;&#x548C;&#x4E3B;&#x63A7;&#x7535;&#x8DEF;&#x56DB;&#x5927;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;PCB&#x5236;&#x7248;&#x3001;&#x710A;&#x63A5;&#x548C;&#x521D;&#x6B65;&#x6D4B;&#x8BD5;&#xFF0C;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7535;&#x5B50;&#x5B66;&#x548C;&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x8054;&#x5408;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E3A;&#x540E;&#x7EED;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x505A;&#x51C6;&#x5907;&#x3002;</p>
<h2 id="&#x7814;&#x7A76;&#x80CC;&#x666F;&#x548C;&#x610F;&#x4E49;">&#x7814;&#x7A76;&#x80CC;&#x666F;&#x548C;&#x610F;&#x4E49;</h2>
<hr>
<p>&#x7C92;&#x5B50;&#x7269;&#x7406;&#x7814;&#x7A76;&#x6BD4;&#x539F;&#x5B50;&#x6838;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x7269;&#x8D28;&#x6784;&#x6210;&#x53CA;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x4E0E;&#x5B87;&#x5B99;&#x8D77;&#x6E90;&#x53CA;&#x6F14;&#x5316;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#x5F15;&#x9886;&#x7740;&#x4EBA;&#x7C7B;&#x57FA;&#x672C;&#x65F6;&#x7A7A;&#x89C2;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x662F;&#x4EBA;&#x7C7B;&#x8BA4;&#x8BC6;&#x4E16;&#x754C;&#x6700;&#x524D;&#x6CBF;&#x7684;&#x79D1;&#x5B66;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5B83;&#x4E5F;&#x884D;&#x751F;&#x4E86;&#x8BB8;&#x591A;&#x65B0;&#x7684;&#x4EA4;&#x53C9;&#x5B66;&#x79D1;&#xFF0C;&#x50AC;&#x751F;&#x4E86;&#x4E13;&#x7528;&#x7684;&#x5927;&#x578B;&#x79D1;&#x5B66;&#x88C5;&#x7F6E;&#xFF08;&#x5982;&#x5BF9;&#x649E;&#x673A;&#x548C;&#x52A0;&#x901F;&#x5668;&#xFF09;&#x7684;&#x5EFA;&#x8BBE;&#xFF0C;&#x53D1;&#x5C55;&#x4E3A;&#x591A;&#x5B66;&#x79D1;&#x4EA4;&#x53C9;&#x524D;&#x6CBF;&#x7814;&#x7A76;&#x7684;&#x5927;&#x578B;&#x7EFC;&#x5408;&#x6027;&#x5E73;&#x53F0;&#x3002;</p>
<p><strong>&#x57FA;&#x4E8E;&#x52A0;&#x901F;&#x5668;&#x7684;&#x7C92;&#x5B50;&#x7269;&#x7406;&#x5B9E;&#x9A8C;</strong>&#x662F;&#x7814;&#x7A76;&#x5FAE;&#x89C2;&#x7269;&#x8D28;&#x4E16;&#x754C;&#x6700;&#x6709;&#x6548;&#x7684;&#x624B;&#x6BB5;&#x4E4B;&#x4E00;&#x3002;&#x5F53;&#x4ECA;&#x57FA;&#x4E8E;&#x52A0;&#x901F;&#x5668;&#x7684;&#x7C92;&#x5B50;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x7814;&#x7A76;&#x53EF;&#x5206;&#x4E3A;&#x9AD8;&#x80FD;&#x91CF;&#x524D;&#x6CBF;&#x548C;&#x9AD8;&#x4EAE;&#x5EA6;&#x524D;&#x6CBF;&#xFF0C;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x524D;&#x6CBF;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x3002;&#x4F5C;&#x4E3A;<strong>&#x9AD8;&#x4EAE;&#x5EA6;</strong>&#x524D;&#x6CBF;&#x52A0;&#x901F;&#x5668;&#x5B9E;&#x9A8C;&#x88C5;&#x7F6E;&#x7684;&#x91CD;&#x8981;&#x4EE3;&#x8868;&#x4E4B;&#x4E00;&#xFF0C;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x5BF9;&#x649E;&#x673A;&#x2014;&#x2014;&#x9676;&#x7CB2;&#x5DE5;&#x5382;&#x8FD0;&#x884C;&#x5728;&#x9676;&#x7CB2;&#x80FD;&#x533A;&#xFF08;&#x8D28;&#x5FC3;&#x80FD;&#x91CF;&#x4E3A;2-5GeV&#xFF09;&#xFF0C;&#x5728;&#x8FC7;&#x53BB;&#x7684;40&#x5E74;&#x6765;&#x4E00;&#x76F4;&#x662F;&#x7C92;&#x5B50;&#x7269;&#x7406;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#x4E4B;&#x4E00;&#x3002;&#x7531;&#x4E2D;&#x56FD;&#x4E3B;&#x6301;&#x5EFA;&#x8BBE;&#x7684;&#x5317;&#x4EAC;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x5BF9;&#x649E;&#x673A;/&#x5317;&#x4EAC;&#x8C31;&#x4EEA;(BEPCII/BESIII)&#x5B9E;&#x9A8C;&#x66FE;&#x5728;&#x5386;&#x53F2;&#x4E0A;&#x505A;&#x51FA;&#x4E86;&#x9676;&#x8F7B;&#x5B50;&#x8D28;&#x91CF;&#x6D4B;&#x91CF;&#x3001;R&#x503C;&#x6D4B;&#x91CF;&#x3001;&#x53D1;&#x73B0;X(1835)&#x7B49;&#x4EE4;&#x4E16;&#x4EBA;&#x77A9;&#x76EE;&#x7684;&#x7269;&#x7406;&#x6210;&#x679C;&#xFF0C;&#x4E3A;&#x4E2D;&#x56FD;&#x7684;&#x9AD8;&#x80FD;&#x7269;&#x7406;&#x7814;&#x7A76;&#x5960;&#x5B9A;&#x4E86;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x7531;&#x4E8E;&#x53D7;&#x5230;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4EE5;&#x53CA;&#x90E8;&#x5206;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6761;&#x4EF6;&#x7684;&#x7EA6;&#x675F;&#xFF0C;BEPCII/BESIII&#x6CA1;&#x6709;&#x8FDB;&#x4E00;&#x6B65;&#x5927;&#x5E45;&#x5EA6;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x7684;&#x7A7A;&#x95F4;&#x4E0E;&#x6F5C;&#x529B;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x968F;&#x7740;&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x8001;&#x5316;&#x4EE5;&#x53CA;&#x56FD;&#x9645;&#x4E0A;&#x5176;&#x4ED6;&#x7C92;&#x5B50;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#xFF08;&#x5982;BELLE-II&#xFF0C;LHCb&#x7B49;&#xFF09;&#x7684;&#x7ADE;&#x4E89;&#xFF0C;BEPCII/BESIII&#x5C06;&#x4E8E; 5&#x2014;10&#x5E74;&#x5B8C;&#x6210;&#x5176;&#x5386;&#x53F2;&#x4F7F;&#x547D;&#x3002;&#x9274;&#x4E8E;&#x4EE5;&#x4E0A;&#x6240;&#x8FF0;&#x9676;&#x7CB2;&#x80FD;&#x533A;&#x7269;&#x7406;&#x7684;&#x91CD;&#x8981;&#x6027;&#x548C;&#x9700;&#x6C42;&#xFF0C;&#x4EE5;&#x53CA;&#x5F53;&#x524D;&#x56FD;&#x5185;&#x5916;&#x5728;&#x8BE5;&#x80FD;&#x533A;&#x5B9E;&#x9A8C;&#x7814;&#x7A76;&#x7684;&#x73B0;&#x72B6;&#xFF0C;&#x4E2D;&#x56FD;&#x63D0;&#x51FA;&#x4E86;&#x5EFA;&#x8BBE;&#x4E00;&#x53F0;&#x65B0;&#x4E00;&#x4EE3;&#x7684;<strong>&#x8D85;&#x9AD8;&#x4EAE;&#x5EA6;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x5BF9;&#x649E;&#x673A;&#x2014;&#x2014;&#x8D85;&#x7EA7;&#x9676;&#x7CB2;&#x88C5;&#x7F6E;</strong>&#xFF0C;&#x4EE5;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x5728;&#x8BE5;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x7684;&#x9886;&#x5148;&#x5730;&#x4F4D;&#x3002;</p>
<img title="overall_layout_of_STCF" src="/images/overall_layout_of_STCF.png" alt="overall_layout_of_STCF" width="450">
<p>STCF&#x6574;&#x4F53;&#x5E03;&#x5C40;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x4E86;&#x4EAE;&#x5EA6;&#x5927;&#x4E8E;0.5&#xD7;1035 cm-2s-1&#xFF0C;&#x5BF9;&#x649E;&#x7684;&#x8D28;&#x5FC3;&#x80FD;&#x91CF;&#x8986;&#x76D6;2&#x2014;7GeV&#x7684;&#x52A0;&#x901F;&#x5668;&#x8BBE;&#x65BD;&#xFF0C;&#x4E00;&#x53F0;&#x80FD;&#x591F;&#x9002;&#x5E94;&#x9AD8;&#x4EAE;&#x5EA6;&#x73AF;&#x5883;&#x3001;&#x6EE1;&#x8DB3;&#x7269;&#x7406;&#x7814;&#x7A76;&#x9700;&#x6C42;&#x7684;&#x591A;&#x529F;&#x80FD;&#x78C1;&#x8C31;&#x4EEA;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3002;</p>
<p><strong>STCF&#x52A0;&#x901F;&#x5668;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#x662F;&#x5982;&#x4F55;&#x7A81;&#x7834;&#x5CF0;&#x503C;&#x5BF9;&#x649E;&#x4EAE;&#x5EA6;</strong>&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8D85;&#x9AD8;&#x4EAE;&#x5EA6;&#xFF0C;STCF&#x5C06;&#x91C7;&#x7528;&#x5E7F;&#x6CDB;&#x8FD0;&#x7528;&#x7684;&#x6241;&#x5E73;&#x5BF9;&#x79F0;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x675F;&#x548C;&#x53CC;&#x73AF;&#x7ED3;&#x6784;&#x3002;STCF&#x63A2;&#x6D4B;&#x8C31;&#x4EEA;&#x662F;&#x7531;&#x591A;&#x79CD;&#x7C92;&#x5B50;&#x63A2;&#x6D4B;&#x5668;&#x7EC4;&#x5408;&#x800C;&#x6210;&#x7684;&#x5927;&#x578B;&#x7EFC;&#x5408;&#x63A2;&#x6D4B;&#x88C5;&#x7F6E;&#xFF0C;&#x7528;&#x6765;&#x5BF9;&#x6B63;&#x8D1F;&#x7535;&#x5B50;&#x5BF9;&#x649E;&#x540E;&#x4EA7;&#x751F;&#x7684;&#x672B;&#x6001;&#x7C92;&#x5B50;&#xFF08;&#x8D28;&#x5B50;&#x3001;&#x3C0;&#x3001;K&#x3001;&#x7535;&#x5B50;&#x3001;&#x7F2A;&#x5B50;&#x548C;&#x5149;&#x5B50;&#x7B49;&#xFF09;&#x8FDB;&#x884C;&#x63A2;&#x6D4B;&#x548C;&#x79CD;&#x7C7B;&#x9274;&#x522B;&#x3002;</p>
<img src="/images/components_of_STCF_detector.png" alt="components_of_STCF_detector" title="components_of_STCF_detector" width="500">
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x63A2;&#x6D4B;&#x8C31;&#x4EEA;&#x7531;&#x5185;&#x5230;&#x5916;&#x5305;&#x62EC;<strong>&#x5185;&#x5F84;&#x8FF9;&#x63A2;&#x6D4B;&#x5668;(Inner Tracker, ITK)&#x3001;&#x5916;&#x5F84;&#x8FF9;&#x63A2;&#x6D4B;&#x5668;(MDC)&#x3001;&#x7C92;&#x5B50;&#x9274;&#x522B;&#x5668;(Particle Identification, PID)&#x3001;&#x7535;&#x78C1;&#x91CF;&#x80FD;&#x5668;(ElectroMagnetic Calorimeter, EMC)&#x3001;&#x8D85;&#x5BFC;&#x78C1;&#x94C1;(Superconducting magnet)&#x548C;&#x7F2A;&#x5B50;&#x63A2;&#x6D4B;&#x5668;(Muon Detector, MUD)</strong> &#x3002;</p>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x5916;&#x5F84;&#x63A2;&#x6D4B;&#x5668;&#x662F;&#x5305;&#x56F4;&#x7740;&#x5185;&#x5F84;&#x8FF9;&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x5706;&#x67F1;&#x5F62;&#x7684;&#x7CBE;&#x5BC6;&#x6F02;&#x79FB;&#x5BA4;&#xFF0C;<strong>&#x5B83;&#x627F;&#x62C5;&#x4E86;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x5F84;&#x8FF9;&#x548C;&#x52A8;&#x91CF;&#x6D4B;&#x91CF;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x53C8;&#x53EB;&#x4E3B;&#x6F02;&#x79FB;&#x5BA4;(MDC)</strong> &#x3002;MDC&#x540C;&#x65F6;&#x4E5F;&#x6D4B;&#x91CF;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x7684;&#x7535;&#x79BB;&#x80FD;&#x91CF;&#x635F;&#x5931;&#xFF0C;&#x7528;&#x4E8E;&#x9274;&#x522B;&#x4F4E;&#x52A8;&#x91CF;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x3002;MDC&#x5185;&#x5145;&#x6EE1;&#x4E86;&#x6C14;&#x4F53;&#xFF0C;&#x5E76;&#x6CBF;&#x8F74;&#x5411;&#x5E03;&#x7F6E;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7EC6;&#x91D1;&#x5C5E;&#x4E1D;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x5927;&#x91CF;&#x6F02;&#x79FB;&#x5355;&#x5143;&#x3002;&#x901A;&#x8FC7;&#x6D4B;&#x91CF;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x5728;&#x5355;&#x5143;&#x5185;&#x4EA7;&#x751F;&#x7684;&#x7535;&#x79BB;&#x7535;&#x5B50;&#x7684;&#x6F02;&#x79FB;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x5BF9;&#x5E94;&#x7684;&#x6F02;&#x79FB;&#x8DDD;&#x79BB;&#xFF0C;&#x7ED3;&#x5408;&#x9633;&#x6781;&#x4E1D;&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#x5F84;&#x8FF9;&#x7684;&#x4F4D;&#x7F6E;&#x3002;STCF MDC&#x5171;&#x6709;48&#x4E2A;&#x4E1D;&#x5C42;&#xFF0C;&#x5355;&#x4E1D;&#x4F4D;&#x7F6E;&#x5206;&#x8FA8;&#x4E3A;120&#xB5;m&#x3002;</p>
<img src="/images/components_of_electronics_for_particle_physics_experiments.png" alt="components_of_electronics_for_particle_physics_experiments" title="components_of_electronics_for_particle_physics_experiments" width="400">
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;<strong>&#x7C92;&#x5B50;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x4E2D;&#x7684;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x6784;&#x6210;&#x4E3A;&#x524D;&#x7AEF;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x3001;&#x89E6;&#x53D1;&#x5224;&#x9009;&#x7CFB;&#x7EDF;&#x3001;&#x6570;&#x636E;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x548C;&#x6162;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;</strong>&#xFF08;&#x53EF;&#x4EE5;&#x770B;<a href="https://mengisok.github.io/zh-cn/Basic-Components-of-Electronics-of-Particle-Physics-Experiments/">&#x7C92;&#x5B50;&#x7269;&#x7406;&#x5B9E;&#x9A8C;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x6784;&#x6210;</a>&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x5BF9;STCF MDC&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x91C7;&#x96C6;&#x548C;&#x5904;&#x7406;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x4E0E;&#x5176;&#x914D;&#x5957;&#x7684;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><strong>&#x524D;&#x7AEF;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x7684;&#x529F;&#x80FD;</strong>&#x662F;&#x5C06;&#x63A2;&#x6D4B;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x5FAE;&#x5F31;&#x7535;&#x4FE1;&#x53F7;&#x653E;&#x5927;&#xFF0C;&#x6570;&#x5B57;&#x5316;&#x540E;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x4E3A;&#x80FD;&#x591F;&#x53CD;&#x6620;&#x7C92;&#x5B50;&#x7279;&#x6027;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F9B;&#x6570;&#x636E;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x91CD;&#x5EFA;&#x7269;&#x7406;&#x4E8B;&#x4F8B;&#x548C;&#x8BB0;&#x5F55;&#x3002;&#x524D;&#x7AEF;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x5C06;&#x63A2;&#x6D4B;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x4FE1;&#x53F7;&#x7ECF;&#x8FC7;&#x521D;&#x6B65;&#x5904;&#x7406;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5411;&#x89E6;&#x53D1;&#x5224;&#x9009;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x88AB;&#x7C92;&#x5B50;&#x51FB;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x7C92;&#x5B50;&#x5728;&#x63A2;&#x6D4B;&#x5668;&#x4E2D;&#x80FD;&#x91CF;&#x6C89;&#x79EF;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x4F5C;&#x4E3A;&#x89E6;&#x53D1;&#x5224;&#x9009;&#x7684;&#x539F;&#x59CB;&#x6761;&#x4EF6;&#x3002;&#x524D;&#x7AEF;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x9884;&#x5904;&#x7406;&#xFF0C;&#x5982;&#xFF1A;&#x6570;&#x636E;&#x538B;&#x7F29;&#x3001;&#x6570;&#x636E;&#x5F52;&#x4E00;&#x5316;&#x7B49;&#x3002;</p>
<p><strong>&#x89E6;&#x53D1;&#x5224;&#x9009;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;</strong>&#x662F;&#x5BF9;&#x524D;&#x7AEF;&#x7535;&#x5B50;&#x5B66;&#x63D0;&#x4F9B;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5B9E;&#x65F6;&#x5206;&#x6790;&#xFF0C;&#x4ECE;&#x5927;&#x91CF;&#x7684;&#x4E8B;&#x4F8B;&#x6570;&#x636E;&#x4E2D;&#x6311;&#x9009;&#x51FA;&#x7269;&#x7406;&#x4E0A;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E8B;&#x4F8B;&#xFF0C;&#x800C;&#x5C06;&#x5047;&#x4E8B;&#x4F8B;&#x6570;&#x636E;&#x820D;&#x5F03;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;</strong>&#x662F;&#x5C06;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x6570;&#x5B57;&#x5316;&#x7684;&#x6570;&#x636E;&#x6536;&#x96C6;&#x5E76;&#x88C5;&#x914D;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x4E8B;&#x4F8B;&#x6570;&#x636E;&#xFF0C;&#x8BB0;&#x5F55;&#x5728;&#x6D77;&#x91CF;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;</p>
<h2 id="&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x7ED3;&#x6784;">&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x7ED3;&#x6784;</h2>
<hr>
<h3 id="MDC&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x65B9;&#x6848;">MDC&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x65B9;&#x6848;</h3>
<p>&#x5728;STCF MDC&#x521D;&#x6B65;&#x7684;&#x6982;&#x5FF5;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;MDC&#x5305;&#x542B;11520&#x4E2A;&#x5355;&#x5143;&#xFF0C;&#x4FE1;&#x53F7;&#x7684;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x901A;&#x9053;&#x603B;&#x6570;&#x4E5F;&#x662F;11520&#x4E2A;&#x3002;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x5728;&#x7AEF;&#x76D6;&#x4E2D;&#xFF0C;&#x7AEF;&#x76D6;&#x7531;15&#x6BEB;&#x7C73;&#x539A;&#x7684;&#x94DD;&#x677F;&#x5236;&#x6210;&#xFF0C;&#x7528;&#x4E8E;&#x673A;&#x68B0;&#x652F;&#x6491;&#x3002;&#x675F;&#x6D41;&#x6A21;&#x62DF;&#x7684;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;MDC&#x7684;&#x7B2C;&#x4E00;&#x5C42;&#xFF08;&#x6700;&#x5185;&#x5C42;&#xFF09;&#x53D7;&#x5230;&#x6700;&#x9AD8;&#x7684;&#x80CC;&#x666F;&#x8BA1;&#x6570;&#x7387;&#xFF08;&#x5927;&#x7EA6;&#x4E3A;200&#x81F3;400kHz&#xFF09;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x4F1A;&#x4F7F;&#x4FE1;&#x53F7;&#x4E8B;&#x4EF6;&#x7684;&#x5E26;&#x7535;&#x8F68;&#x8FF9;&#x6D4B;&#x91CF;&#x53D7;&#x5230;&#x4E25;&#x91CD;&#x7684;&#x5E72;&#x6270;&#x3002;GARFIELD&#x6A21;&#x62DF;&#x7684;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x7531;&#x4E8E;&#x7535;&#x5B50;&#x6309;&#x7C92;&#x5B50;&#x8F68;&#x9053;&#x5230;&#x5BFC;&#x7EBF;&#x7684;&#x8DDD;&#x79BB;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5206;&#x5E03;&#xFF0C;&#x6BCF;&#x4E2A;&#x5355;&#x5143;&#x4E2D;&#x7684;&#x4FE1;&#x53F7;&#x6301;&#x7EED;200&#x5230;500ns&#x3002;&#x56E0;&#x6B64;&#xFF0C;MDC&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x9AD8;&#x7CBE;&#x5EA6;&#x7684;&#x65F6;&#x95F4;&#x6D4B;&#x91CF;&#xFF08;&#x5927;&#x7EA6;0.5ns RMS&#xFF09;&#x548C;&#x7535;&#x8377;&#x6D4B;&#x91CF;&#xFF08;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x7684;&#x632F;&#x5E45;&#x53EF;&#x8FBE;1.8pC&#xFF09;&#x3002;</p>
<img src="/images/STCF_MDC_readout_electronics_system_architecture.png" alt="STCF_MDC_readout_electronics_system_architecture" title="STCF_MDC_readout_electronics_system_architecture" width="550">
<p>STCF MDC&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x89C1;&#x4E0A;&#x56FE;&#xFF0C;<strong>&#x7531;FEE&#x6A21;&#x5757;&#x548C;RU&#x6A21;&#x5757;&#x7EC4;&#x6210;</strong>&#x3002;MDC&#x7684;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E0E;&#x7CFB;&#x7EDF;&#x65F6;&#x949F;&#x4FE1;&#x53F7;&#x540C;&#x6B65;&#xFF0C;&#x8BE5;&#x4FE1;&#x53F7;&#x7531;RU&#x63A5;&#x6536;&#xFF0C;&#x7136;&#x540E;&#x6247;&#x51FA;&#x5230;FEE&#x3002;FEE&#x7684;&#x8F93;&#x51FA;&#x7531;RU&#x6536;&#x96C6;&#xFF0C;RU&#x8FDB;&#x4E00;&#x6B65;&#x6C47;&#x603B;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5E76;&#x901A;&#x8FC7;&#x5149;&#x7EA4;&#x5C06;&#x4FE1;&#x53F7;&#x4F20;&#x9001;&#x5230;DAQ&#x3002;RU&#x8FD8;&#x63A5;&#x6536;&#x5168;&#x5C40;&#x89E6;&#x53D1;&#x4FE1;&#x53F7;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x6247;&#x5411;FEE&#xFF0C;&#x4EE5;&#x8FDB;&#x884C;&#x89E6;&#x53D1;&#x5339;&#x914D;&#xFF0C;&#x4ECE;&#x800C;&#x8BFB;&#x51FA;&#x6709;&#x6548;&#x6570;&#x636E;&#x3002;</p>
<img src="/images/structure_of_FEE.png" alt="structure_of_FEE" title="structure_of_FEE" width="600">
<p>FEE&#x7684;&#x7535;&#x8DEF;&#x7ED3;&#x6784;&#x89C1;&#x4E0A;&#x56FE;&#x3002;<strong>FEE&#x8D1F;&#x8D23;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#x7684;&#x5904;&#x7406;&#x3001;A/D&#x8F6C;&#x6362;&#x4EE5;&#x53CA;&#x65F6;&#x95F4;&#x4FE1;&#x606F;&#x548C;&#x7535;&#x8377;&#x4FE1;&#x606F;&#x7684;&#x6D4B;&#x91CF;</strong>&#x3002;&#x6765;&#x81EA;&#x63A2;&#x6D4B;&#x5668;MDC&#x7684;&#x4FE1;&#x53F7;&#x9996;&#x5148;&#x88AB;<strong>&#x8DE8;&#x963B;&#x653E;&#x5927;&#x5668;(Trans-Impedance Amplifier, TIA)</strong> &#x653E;&#x5927;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x65F6;&#x95F4;&#x6D4B;&#x91CF;&#x7684;&#x5FEB;&#x901F;&#x54CD;&#x5E94;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x7535;&#x8377;&#x6D4B;&#x91CF;&#x3002;&#x7136;&#x540E;&#xFF0C;<u>TIA&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x88AB;&#x5206;&#x6210;&#x4E24;&#x8DEF;&#xFF1A;&#x4E00;&#x8DEF;&#x8FDE;&#x63A5;&#x5230;&#x7535;&#x8377;&#x6D4B;&#x91CF;&#x7535;&#x8DEF;&#xFF0C;&#x53E6;&#x4E00;&#x8DEF;&#x8FDE;&#x63A5;&#x5230;&#x65F6;&#x95F4;&#x6D4B;&#x91CF;&#x7535;&#x8DEF;</u>&#x3002;</p>
<p>&#x5BF9;&#x4E8E;<u>&#x65F6;&#x95F4;&#x6D4B;&#x91CF;</u>&#xFF0C;&#x8003;&#x8651;&#x5230;&#x4FE1;&#x53F7;&#x7684;&#x7279;&#x5F81;&#x5F62;&#x72B6;&#xFF0C;<strong>&#x9274;&#x522B;&#x5668;(Discriminator, Disc)</strong> &#x7684;&#x9608;&#x503C;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x4F4E;&#x7535;&#x5E73;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8F83;&#x9AD8;&#x7684;&#x65F6;&#x95F4;&#x7CBE;&#x5EA6;&#xFF0C;&#x4F4D;&#x4E8E;&#x9274;&#x522B;&#x5668;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;<strong>&#x653E;&#x5927;&#x5668;(Amplifier)</strong> &#x88AB;&#x7528;&#x6765;&#x63D0;&#x9AD8;&#x4FE1;&#x53F7;&#x7684;&#x56DE;&#x8F6C;&#x7387;&#x3002;&#x4E3A;&#x4E86;&#x8FC7;&#x6EE4;&#x6389;&#x566A;&#x58F0;&#x8D8A;&#x8FC7;&#x4F4E;&#x9608;&#x503C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7ECF;&#x8FC7;&#x6574;&#x5F62;&#x540E;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x9AD8;&#x9608;&#x503C;&#x9274;&#x522B;&#x5668;&#x3002;&#x7136;&#x540E;&#xFF0C;<strong>&#x65F6;&#x95F4;-&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x5668;(Time-to-Digital Converter, TDC)</strong> &#x7528;&#x4E8E;&#x5C06;&#x4F4E;&#x9608;&#x503C;&#x9274;&#x522B;&#x5668;&#x7684;&#x524D;&#x6CBF;&#x65F6;&#x95F4;&#x6570;&#x5B57;&#x5316;&#x3002;</p>
<p><u>&#x7535;&#x8377;&#x6D4B;&#x91CF;</u>&#x7535;&#x8DEF;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;<strong>&#x6574;&#x5F62;&#x7535;&#x8DEF;(Shaper)</strong> &#x6765;&#x63D0;&#x9AD8;&#x4FE1;&#x566A;&#x6BD4;&#xFF0C;&#x5176;&#x8F93;&#x51FA;&#x6CE2;&#x5F62;&#x88AB;<strong>&#x6A21;&#x62DF;-&#x6570;&#x5B57;&#x8F6C;&#x6362;&#x5668;(Analog-to-Digital Converter, ADC)</strong> &#x6570;&#x5B57;&#x5316;&#x5E76;&#x88AB;&#x53D1;&#x9001;&#x5230;<strong>FPGA</strong>&#x8FDB;&#x884C;&#x7535;&#x8377;&#x8BA1;&#x7B97;&#x3002;&#x6574;&#x5F62;&#x7535;&#x8DEF;&#x7684;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x88AB;&#x9001;&#x5165;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x9AD8;&#x9608;&#x503C;&#x7684;&#x9274;&#x522B;&#x5668;&#x3002;&#x8BE5;&#x9274;&#x522B;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x88AB;&#x7528;&#x4F5C;&#x542F;&#x52A8;&#x7535;&#x8377;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x7684;&#x6807;&#x5FD7;&#x4FE1;&#x53F7;&#xFF08;HIT flag&#xFF09;&#xFF0C;&#x5E76;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;&#x6709;&#x6548;&#x201D;&#x6761;&#x4EF6;&#x7528;&#x4E8E;&#x4F4E;&#x9608;&#x503C;&#x9274;&#x522B;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x65F6;&#x95F4;&#x6D4B;&#x91CF;&#x3002;&#x4E3A;&#x4E86;&#x6291;&#x5236;<strong>&#x5806;&#x79EF;(Data Packaging)</strong> &#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x6570;&#x5B57;&#x5316;&#x540E;&#x7684;&#x4FE1;&#x53F7;&#x6CE2;&#x5F62;&#x4E0A;&#x7684;&#x57FA;&#x7EBF;&#x6062;&#x590D;&#x548C;&#x6570;&#x5B57;&#x5904;&#x7406;&#x5C06;&#x88AB;&#x5E94;&#x7528;&#x4E8E;&#x7535;&#x8DEF;&#x8BBE;&#x8BA1;&#x4E2D;&#x3002;</p>
<h3 id="&#x9A8C;&#x8BC1;&#x677F;&#x7684;&#x5B50;&#x6BCD;&#x677F;&#x7ED3;&#x6784;">&#x9A8C;&#x8BC1;&#x677F;&#x7684;&#x5B50;&#x6BCD;&#x677F;&#x7ED3;&#x6784;</h3>
<img src="/images/circuit_model_in_LTspice.png" alt="circuit_model_in_LTspice" title="circuit_model_in_LTspice" width="1000">
<p>&#x4E0A;&#x56FE;&#x662F;&#x5728;LTspice&#x8F6F;&#x4EF6;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x7535;&#x8DEF;&#x5EFA;&#x6A21;&#x548C;&#x4EFF;&#x771F;&#x3002;&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x786E;&#x4FDD;&#x65B9;&#x6848;&#x7684;&#x539F;&#x7406;&#x6B63;&#x786E;&#x6027;&#x548C;&#x5E94;&#x7528;&#x53EF;&#x884C;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x521D;&#x6B65;&#x7684;&#x5B9E;&#x9645;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x9A8C;&#x8BC1;&#x677F;&#x3002;</p>
<img src="/images/daughterboard_and_motherboard_structure_for_FEE.png" alt="daughterboard_and_motherboard_structure_for_FEE" title="daughterboard_and_motherboard_structure_for_FEE" width="500">
<p>&#x5728;&#x786C;&#x4EF6;&#x7ED3;&#x6784;&#x4E0A;&#xFF0C;&#x5C06;&#x9A8C;&#x8BC1;&#x677F;&#x8BBE;&#x8BA1;&#x6210;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x7684;<strong>&#x7075;&#x6D3B;&#x7684;&#x5B50;&#x6BCD;&#x677F;&#x5F62;&#x5F0F;</strong>&#xFF0C;&#x5373;&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x548C;&#x6570;&#x5B57;&#x6BCD;&#x677F;&#x7684;&#x7EC4;&#x5408;&#x3002;<strong>&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x63A5;&#x6536;&#x548C;&#x8C03;&#x7406;&#x6765;&#x81EA;MDC&#x7684;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;</strong>&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5DEE;&#x5206;LEMO&#x63A5;&#x63D2;&#x4EF6;&#x5C06;&#x4FE1;&#x53F7;&#x8F93;&#x5165;&#x6570;&#x5B57;&#x6BCD;&#x677F;&#x3002;<strong>&#x6570;&#x5B57;&#x6BCD;&#x677F;&#x5BF9;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x6A21;&#x62DF;-&#x6570;&#x5B57;&#x8F6C;&#x6362;&#xFF0C;&#x5E76;&#x5728;FPGA&#x4E2D;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x7684;&#x5904;&#x7406;&#x548C;&#x8BA1;&#x7B97;</strong>&#xFF0C;&#x6700;&#x540E;&#x901A;&#x8FC7;&#x63A5;&#x63D2;&#x4EF6;&#x5C06;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#x5230;PC&#x7AEF;&#x3002;&#x4F7F;&#x7528;&#x9AD8;&#x901F;ADC&#x5B9E;&#x73B0;32&#x901A;&#x9053;&#x7684;&#x4FE1;&#x53F7;&#x8BFB;&#x51FA;&#x8F83;&#x4E3A;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x6B64;&#x5355;&#x4E2A;&#x9A8C;&#x8BC1;&#x677F;&#x7CFB;&#x7EDF;&#x7684;&#x901A;&#x9053;&#x6570;&#x5B9A;&#x4E3A;16&#x3002;&#x5355;&#x4E2A;&#x5B50;&#x677F;&#x4E0A;&#x6709;2&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x5355;&#x4E2A;&#x6BCD;&#x677F;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;2&#x5757;&#x5B50;&#x677F;&#xFF0C;&#x6545;&#x5355;&#x4E2A;&#x9A8C;&#x8BC1;&#x677F;&#x7CFB;&#x7EDF;&#x5305;&#x542B;8&#x4E2A;&#x5B50;&#x677F;&#x548C;4&#x4E2A;&#x6BCD;&#x677F;&#x3002;</p>
<p><strong>&#x5B50;&#x677F;&#x4E3B;&#x8981;&#x5305;&#x542B;TIA&#x4EE5;&#x53CA;ADC&#x9A71;&#x52A8;</strong>&#x3002;&#x7531;&#x4E8E;ADC&#x7684;&#x91C7;&#x6837;&#x7387;&#x5927;&#x6982;&#x5728;500MHz &#x81F3;1GHz&#x4E4B;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x8003;&#x8651;&#x91C7;&#x7528;&#x578B;&#x53F7;&#x4E3A;GM4680-1000&#x7684;&#x53CC;&#x901A;&#x9053;&#x3001;14&#x4F4D;&#x3001;&#x91C7;&#x6837;&#x7387;&#x4E3A;1GHz&#x7684;ADC&#x82AF;&#x7247;&#x3002;&#x6BCD;&#x677F;&#x4E2D;&#xFF0C;FPGA&#x82AF;&#x7247;&#x7684;&#x9009;&#x578B;&#x9700;&#x8981;&#x4F18;&#x5148;&#x6EE1;&#x8DB3;ADC&#x7684;&#x6570;&#x636E;&#x63A5;&#x6536;&#x8981;&#x6C42;&#xFF0C;&#x4FDD;&#x8BC1;&#x9AD8;&#x901F;&#x6536;&#x53D1;&#x5668;&#x63A5;&#x53E3;&#x7684;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x65F6;&#x949F;&#x7531;&#x672C;&#x5730;&#x6676;&#x632F;&#x6216;&#x8005;&#x65F6;&#x949F;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x3002;&#x7531;FPGA&#x4EA7;&#x751F;ADC&#x9A71;&#x52A8;&#x5668;&#x7684;&#x65F6;&#x949F;&#xFF0C;&#x7ECF;&#x8FC7;&#x65F6;&#x949F;&#x9A71;&#x52A8;&#x53D1;&#x9001;&#x81F3;&#x5404;ADC&#x4EE5;&#x4FDD;&#x8BC1;&#x6240;&#x6709;ADC&#x540C;&#x6B65;&#x5DE5;&#x4F5C;&#x3002;MDC&#x7535;&#x5B50;&#x5B66;&#x7684;&#x65F6;&#x949F;&#x540C;&#x6B65;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x65F6;&#x949F;&#x63A5;&#x53E3;&#x5B8C;&#x6210;&#x3002;</p>
<p>MDC&#x4FE1;&#x53F7;&#x8F93;&#x5165;&#x63A5;&#x53E3;&#x7531;&#x63A2;&#x6D4B;&#x5668;MDC&#x7684;&#x8F93;&#x51FA;&#x51B3;&#x5B9A;&#x3002;&#x6570;&#x636E;&#x89E6;&#x53D1;&#x63A5;&#x53E3;&#x7531;DAQ&#x4E0E;&#x89E6;&#x53D1;&#x7CFB;&#x7EDF;&#x5171;&#x540C;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x6807;&#x5B9A;&#x7535;&#x8DEF;&#x7528;&#x4E8E;&#x540E;&#x7EED;&#x6D4B;&#x8BD5;&#x6216;&#x8005;&#x7535;&#x5B50;&#x5B66;&#x529F;&#x80FD;&#x81EA;&#x68C0;&#x3002;</p>
<h2 id="&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x7684;&#x8BBE;&#x8BA1;">&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x7684;&#x8BBE;&#x8BA1;</h2>
<hr>
<p>&#x4F7F;&#x7528;Cadence&#x8FDB;&#x884C;&#x7535;&#x5B50;&#x5B66;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x9996;&#x5148;&#x5728;OrCAD Capture CIS&#x4E2D;&#x8BBE;&#x8BA1;&#x7535;&#x8DEF;&#x539F;&#x7406;&#x56FE;&#xFF0C;&#x7136;&#x540E;&#x5728;Allegro PCB Editor&#x4E2D;&#x8BBE;&#x8BA1;&#x5370;&#x5237;&#x7535;&#x8DEF;&#x677F;(Printed Circuit Board, PCB)&#x3002;</p>
<h3 id="&#x539F;&#x7406;&#x56FE;&#x8BBE;&#x8BA1;">&#x539F;&#x7406;&#x56FE;&#x8BBE;&#x8BA1;</h3>


	<div class="row">
    <embed src="/pdf/schematic.pdf" width="100%" height="550" type="application/pdf">
	</div>



<p>&#x4E0A;&#x9762;&#x662F;&#x5B50;&#x677F;&#x7684;&#x539F;&#x7406;&#x56FE;&#xFF0C;&#x5171;4&#x9875;&#xFF0C;&#x4F9D;&#x6B21;&#x4E3A;<mark>TIA&#x4E0E;ADC&#x9A71;&#x52A8;&#x3001;&#x7535;&#x6E90;&#x3001;&#x4E3B;&#x63A7;&#x548C;&#x6807;&#x5B9A;</mark>&#x90E8;&#x5206;&#x7684;&#x7535;&#x8DEF;&#x3002;</p>
<ul>
<li><mark>TIA&#x4E0E;ADC&#x9A71;&#x52A8;&#x90E8;&#x5206;</mark></li>
</ul>
<p><strong>&#x6765;&#x81EA;&#x63A2;&#x6D4B;&#x5668;MDC&#x7684;&#x6A21;&#x62DF;&#x4FE1;&#x53F7;&#x901A;&#x8FC7;LEMO&#x63A5;&#x63D2;&#x4EF6;&#x8F93;&#x5165;&#x5B50;&#x677F;&#xFF0C;&#x7136;&#x540E;&#x7ECF;&#x8FC7;&#x9694;&#x76F4;&#x7535;&#x5BB9;&#x548C;&#x5339;&#x914D;&#x7535;&#x963B;&#x8FDB;&#x5165;&#x524D;&#x7F6E;&#x653E;&#x5927;&#x5668;</strong>&#x3002;&#x524D;&#x7F6E;&#x653E;&#x5927;&#x5668;&#x662F;&#x6307;&#x7F6E;&#x4E8E;&#x4FE1;&#x53F7;&#x6E90;&#x4E0E;&#x653E;&#x5927;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x7535;&#x8DEF;&#x6216;&#x7535;&#x5B50;&#x8BBE;&#x5907;&#xFF0C;&#x662F;&#x4E13;&#x4E3A;&#x63A5;&#x53D7;&#x6765;&#x81EA;&#x4FE1;&#x53F7;&#x6E90;&#x7684;&#x5FAE;&#x5F31;&#x4FE1;&#x53F7;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x5904;&#x7406;&#x7535;&#x8377;&#xFF08;&#x7535;&#x6D41;&#xFF09;&#x4FE1;&#x606F;&#x7684;&#x524D;&#x7F6E;&#x653E;&#x5927;&#x5668;&#x79F0;&#x4E3A;&#x7535;&#x8377;&#x7075;&#x654F;&#x653E;&#x5927;&#x5668;&#x3002;</p>
<p><strong>&#x524D;&#x7F6E;&#x653E;&#x5927;&#x5668;&#x91C7;&#x7528;OPA855&#x82AF;&#x7247;</strong>&#x3002;&#x5B83;&#x662F;&#x4E00;&#x6B3E;&#x5177;&#x6709;&#x53CC;&#x6781;&#x8F93;&#x5165;&#x7684;&#x5BBD;&#x9891;&#x5E26;&#x4F4E;&#x566A;&#x58F0;&#x8FD0;&#x7B97;&#x653E;&#x5927;&#x5668;&#xFF0C;&#x9002;&#x7528;&#x4E8E;<strong>&#x5BBD;&#x5E26;&#x8DE8;&#x963B;&#x548C;&#x7535;&#x538B;&#x653E;&#x5927;</strong>&#x3002;&#x5982;&#x679C;&#x5C06;&#x8BE5;&#x8FD0;&#x7B97;&#x653E;&#x5927;&#x5668;&#x914D;&#x7F6E;&#x4E3A;TIA&#xFF0C;&#x5219;&#x5B83;&#x7684;8GHz&#x589E;&#x76CA;&#x5E26;&#x5BBD;&#x79EF;(Gain-BandWidth Product, GBWP)&#x80FD;&#x591F;&#x4EE5;&#x9AD8;&#x8FBE;&#x51E0;&#x5341;&#x5343;&#x6B27;&#x59C6;&#x7684;&#x8DE8;&#x963B;&#x589E;&#x76CA;&#x5B9E;&#x73B0;&#x9AD8;&#x95ED;&#x73AF;&#x5E26;&#x5BBD;&#x3002;&#x4EFF;&#x771F;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x663E;&#x793A;&#xFF0C;&#x5F53;OPA855&#x7684;&#x589E;&#x76CA;&#x4E3A;20k&#x3A9;&#xFF0C;&#x63A2;&#x6D4B;&#x5668;&#x7B49;&#x6548;&#x5BF9;&#x5730;&#x7535;&#x5BB9;&#x4E3A;50pF&#x65F6;&#xFF0C;OPA855&#x7684;-3dB&#x5E26;&#x5BBD;&#x4E3A;80MHz&#x3002;OPA855&#x7684;&#x53CD;&#x5411;&#x7AEF;&#x8FDE;&#x63A5;&#x53CD;&#x9988;&#x7535;&#x963B;&#xFF0C;&#x6B63;&#x5411;&#x7AEF;&#x901A;&#x8FC7;0&#x3A9;&#x7684;&#x7535;&#x963B;&#x63A5;&#x5730;&#xFF0C;&#x6216;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6570;&#x5B57;-&#x6A21;&#x62DF;&#x8F6C;&#x6362;&#x5668;(Digital-Analog Converter, DAC)&#x8FDB;&#x884C;&#x57FA;&#x7EBF;&#x914D;&#x7F6E;&#x3002;&#x6839;&#x636E;MDC&#x4FE1;&#x53F7;&#x4E1D;&#x7684;&#x963B;&#x6297;&#x503C;&#xFF0C;&#x9002;&#x5F53;&#x8C03;&#x6574;&#x5339;&#x914D;&#x7535;&#x963B;&#xFF0C;&#x5F53;&#x8FBE;&#x5230;&#x963B;&#x6297;&#x5339;&#x914D;&#x65F6;&#xFF0C;&#x7535;&#x8DEF;&#x7684;&#x566A;&#x58F0;&#x6700;&#x5C0F;&#x3002;&#x7535;&#x6E90;&#x7AEF;&#x9644;&#x8FD1;&#x914D;&#x7F6E;&#x65C1;&#x8DEF;&#x7535;&#x5BB9;&#x4EE5;&#x6EE4;&#x9664;&#x9AD8;&#x9891;&#x566A;&#x58F0;&#xFF0C;&#x51CF;&#x5C11;&#x8026;&#x5408;&#x5E72;&#x6270;&#x3002;</p>
<p>&#x4FE1;&#x53F7;&#x7ECF;&#x8FC7;OPA855&#x7684;&#x8C03;&#x7406;&#x548C;&#x653E;&#x5927;&#x540E;&#xFF0C;&#x8F93;&#x5165;CR-RC&#x65E0;&#x6E90;&#x6EE4;&#x6CE2;&#x7F51;&#x7EDC;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x540E;&#x7EED;&#x7684;&#x8C03;&#x8BD5;&#x3002;&#x7ECF;&#x8FC7;&#x6EE4;&#x6CE2;&#x7F51;&#x7EDC;&#x5904;&#x7406;&#x7684;&#x4FE1;&#x53F7;&#x4F9D;&#x6B21;&#x7ECF;&#x8FC7;&#x7535;&#x5BB9;&#x9694;&#x76F4;&#x548C;&#x7535;&#x963B;&#x5339;&#x914D;&#x540E;&#x8F93;&#x5165;&#x5230;ADC&#x9A71;&#x52A8;&#x5668;&#x4E2D;&#x3002;ADC&#x9A71;&#x52A8;&#x5668;&#x4E00;&#x822C;&#x653E;&#x5728;&#x9760;&#x8FD1;ADC&#x7684;&#x5730;&#x65B9;&#x3002;&#x7535;&#x6E90;&#x7AEF;&#x9644;&#x8FD1;&#x540C;&#x6837;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x65C1;&#x8DEF;&#x7535;&#x5BB9;&#x3002;</p>
<p><strong>ADC&#x9A71;&#x52A8;&#x5668;&#x91C7;&#x7528;LTC6419&#x82AF;&#x7247;</strong>&#x3002;&#x5B83;&#x662F;&#x4E00;&#x6B3E;&#x53CC;&#x901A;&#x9053;&#x3001;&#x6781;&#x9AD8;&#x901F;&#x4E14;&#x4F4E;&#x5931;&#x771F;&#x7684;&#x5DEE;&#x5206;&#x653E;&#x5927;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;<strong>&#x5C06;&#x8F93;&#x5165;&#x7684;&#x5355;&#x7AEF;&#x4FE1;&#x53F7;&#x8F6C;&#x6362;&#x4E3A;&#x5DEE;&#x5206;&#x4FE1;&#x53F7;&#xFF0C;&#x4EE5;&#x9A71;&#x52A8;&#x540E;&#x9762;&#x8FDE;&#x63A5;&#x7684;ADC&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x524D;&#x7F6E;&#x653E;&#x5927;&#x5668;&#x548C;ADC&#x9694;&#x79BB;&#x5F00;&#x6765;&#xFF0C;&#x8D77;&#x5230;&#x7F13;&#x51B2;&#x7684;&#x4F5C;&#x7528;</strong>&#x3002;&#x5DEE;&#x5206;ADC&#x9A71;&#x52A8;&#x5668;&#x662F;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x4FE1;&#x53F7;&#x8C03;&#x7406;&#x5143;&#x4EF6;&#x3002;&#x672C;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;LTC6419&#x7684;&#x5DEE;&#x5206;&#x653E;&#x5927;&#x589E;&#x76CA;&#x914D;&#x7F6E;&#x4E3A;2&#x3002;</p>
<ul>
<li><mark>&#x7535;&#x6E90;&#x90E8;&#x5206;</mark></li>
</ul>
<p><strong>&#x5916;&#x90E8;&#x7535;&#x6E90;&#x901A;&#x8FC7;&#x7535;&#x6E90;&#x63D2;&#x5EA7;&#x8FDB;&#x5165;&#x7535;&#x8DEF;&#x677F;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7535;&#x5BB9;&#x6EE4;&#x6CE2;&#x548C;&#x7535;&#x611F;&#x9694;&#x79BB;&#x7684;&#x5904;&#x7406;&#x540E;&#x8F93;&#x5165;&#x4F4E;&#x538B;&#x5DEE;&#x7A33;&#x538B;&#x5668;(Low-Dropout Regulator, LDO)&#x5143;&#x4EF6;&#x3002;&#x914D;&#x7F6E;LDO&#x5F97;&#x5230;&#x6574;&#x4E2A;&#x7535;&#x8DEF;&#x677F;&#x6240;&#x9700;&#x7684;&#x7535;&#x6E90;&#x7535;&#x538B;</strong>&#x3002;LDO&#x662F;&#x7EBF;&#x6027;&#x76F4;&#x6D41;&#x7A33;&#x538B;&#x5668;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x7A33;&#x5B9A;&#x7684;&#x76F4;&#x6D41;&#x7535;&#x538B;&#x7535;&#x6E90;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x4E00;&#x822C;&#x7EBF;&#x6027;&#x76F4;&#x6D41;&#x7A33;&#x538B;&#x5668;&#xFF0C;LDO&#x80FD;&#x5728;&#x66F4;&#x5C0F;&#x8F93;&#x51FA;-&#x8F93;&#x5165;&#x7535;&#x538B;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5DE5;&#x4F5C;&#x3002;&#x672C;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;LDO&#x5143;&#x4EF6;&#x91C7;&#x7528;LT1764&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x5FEB;&#x901F;&#x7684;&#x77AC;&#x6001;&#x54CD;&#x5E94;&#x548C;&#x6781;&#x4F4E;&#x7684;&#x8F93;&#x51FA;&#x7535;&#x538B;&#x566A;&#x58F0;&#x7B49;&#x4F18;&#x70B9;&#x3002;</p>
<ul>
<li><mark>&#x4E3B;&#x63A7;&#x90E8;&#x5206;</mark></li>
</ul>
<p><strong>&#x4E3B;&#x63A7;&#x5236;&#x90E8;&#x5206;&#x7684;&#x529F;&#x80FD;&#x662F;&#x5168;&#x5C40;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x8FDE;&#x63A5;&#x5B50;&#x677F;&#x548C;&#x6BCD;&#x677F;&#x4E4B;&#x95F4;&#x7684;&#x5404;&#x4E2A;&#x6A21;&#x5757;</strong>&#x3002;&#x5B83;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x5B50;&#x6BCD;&#x677F;&#x63A5;&#x53E3;&#x7684;&#x63A5;&#x63D2;&#x4EF6;&#xFF0C;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x7684;LEMO&#x63A5;&#x63D2;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x591A;&#x4E2A;&#x7528;&#x4E8E;&#x540E;&#x7EED;&#x8C03;&#x8BD5;&#x548C;&#x6D4B;&#x8BD5;&#x7684;&#x9009;&#x62E9;&#x7535;&#x963B;&#x3002;&#x672C;&#x8BBE;&#x8BA1;&#x7684;&#x5B50;&#x6BCD;&#x677F;&#x63A5;&#x53E3;&#x91C7;&#x7528;Samtec&#x516C;&#x53F8;&#x7684;TFM-115-01-L-D-DS&#x578B;&#x53F7;&#x7684;&#x63A5;&#x63D2;&#x4EF6;&#xFF0C;&#x5B83;&#x603B;&#x5171;&#x6709;30&#x4E2A;&#x7BA1;&#x811A;&#x53EF;&#x7528;&#x3002;&#x5BF9;&#x4E8E;&#x4E0A;&#x5347;&#x6CBF;&#x4E3A;1 ns&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x5B83;&#x7684;&#x76F8;&#x90BB;&#x7BA1;&#x811A;&#x4E4B;&#x95F4;&#x7684;&#x4E32;&#x6270;&#x5C0F;&#x4E8E;1%&#xFF1B;&#x5355;&#x7AEF;&#x963B;&#x6297;&#x4E3A;48.2-50.8&#x3A9;&#xFF0C;&#x5DEE;&#x5206;&#x963B;&#x6297;&#x4E3A;92.2-102.8&#x3A9;&#xFF1B;&#x5E26;&#x5BBD;&#x53EF;&#x8FBE;8 GHz&#xFF1B;&#x53EF;&#x901A;&#x8FC7;1A @ 70&#x2103;&#x7684;&#x7535;&#x6D41;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x5B50;&#x6BCD;&#x677F;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x63D2;&#x4EF6;&#x7684;&#x7BA1;&#x811A;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;DIFF_1_SAM_N&#x3001;DIFF_1_SAM_P&#x548C;DIFF_2_SAM_N&#x3001;DIFF_2_SAM_P&#x5206;&#x522B;&#x4E3A;&#x4E24;&#x8DEF;&#x901A;&#x9053;ADC&#x9A71;&#x52A8;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x7BA1;&#x811A;&#xFF1B;DAC_CH_1&#x3001;DAC_CH_2&#x3001;DAC_CH_3&#x3001;&#x548C;DAC_CH_4&#x4E3A;&#x6BCD;&#x677F;&#x4E0A;DAC&#x7684;&#x8F93;&#x51FA;&#x7BA1;&#x811A;&#xFF1B;FPGA_1&#x3001;FPGA_2&#x3001;FPGA_3&#x548C;FPGA_4&#x4E3A;&#x81EA;&#x6807;&#x5B9A;&#x7535;&#x8DEF;&#x7684;&#x63A7;&#x5236;&#x4FE1;&#x53F7;&#xFF0C;&#x8FDE;&#x63A5;&#x81F3;&#x6BCD;&#x677F;&#x4E0A;&#x7684;FPGA&#x82AF;&#x7247;&#xFF1B;MASTER_POWER&#x4E3A;+5.5 V&#x7684;&#x7535;&#x6E90;&#x8F93;&#x5165;&#x7BA1;&#x811A;&#xFF1B;&#x5176;&#x5B83;&#x7BA1;&#x811A;&#x90FD;&#x9700;&#x8981;&#x63A5;&#x5730;&#xFF0C;&#x4EE5;&#x964D;&#x4F4E;&#x566A;&#x58F0;&#x3001;&#x51CF;&#x5C11;&#x7535;&#x78C1;&#x8F90;&#x5C04;&#x3001;&#x4FDD;&#x62A4;&#x4FE1;&#x53F7;&#x3002;</p>
<ul>
<li><mark>&#x6807;&#x5B9A;&#x90E8;&#x5206;</mark></li>
</ul>
<p>&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x6A21;&#x62DF;&#x5F00;&#x5173;&#x7684;&#x65AD;&#x5F00;&#x4E0E;&#x5BFC;&#x901A;&#xFF0C;&#x4F7F;&#x7535;&#x5BB9;C19&#x3001;C20&#x5206;&#x522B;&#x901A;&#x8FC7;&#x7535;&#x963B;R38&#x3001;R41&#x548C;R40&#x3001;R42&#x8FDB;&#x884C;&#x5145;&#x7535;&#x548C;&#x653E;&#x7535;&#xFF0C;&#x5E76;&#x7ECF;&#x8FC7;&#x7535;&#x963B;R36&#x548C;R39&#x8F93;&#x5165;&#x81F3;TIA&#x4E2D;&#xFF0C;&#x4F5C;&#x4E3A;&#x6807;&#x5B9A;&#x4FE1;&#x53F7;&#x3002;&#x6807;&#x5B9A;&#x4FE1;&#x53F7;&#x7684;&#x7535;&#x8377;&#x91CF;&#x7531;&#x6807;&#x5B9A;&#x53C2;&#x8003;&#x7535;&#x538B;&#x4EE5;&#x53CA;&#x7535;&#x5BB9;C19&#x3001;C20&#x51B3;&#x5B9A;&#xFF0C;&#x4FE1;&#x53F7;&#x7279;&#x5F81;&#x7531;&#x7535;&#x5BB9;C19&#x3001;C20&#x548C;&#x7535;&#x963B;R38&#x3001;R41&#x3001;R40&#x3001;R42&#x51B3;&#x5B9A;&#x3002;&#x6807;&#x5B9A;&#x7535;&#x8DEF;&#x4E2D;&#x7684;&#x6A21;&#x62DF;&#x5F00;&#x5173;&#x5143;&#x4EF6;&#x9009;&#x7528;TMUX6211PWR&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x6B3E;&#x56DB;&#x901A;&#x9053;&#x7684;&#x4E92;&#x8865;&#x91D1;&#x5C5E;&#x6C27;&#x5316;&#x7269;&#x534A;&#x5BFC;&#x4F53;(Complementary<br>
Metal-Oxide-Semiconductor, CMOS)&#x7CBE;&#x5BC6;&#x5F00;&#x5173;&#xFF0C;&#x901A;&#x8FC7;SELx&#x5F15;&#x811A;&#x4E0A;&#x9002;&#x5F53;&#x7684;&#x8F93;&#x5165;&#x903B;&#x8F91;&#x6765;&#x63A7;&#x5236;&#x8F93;&#x51FA;&#x3002;TMUX6211PWR&#x7684;&#x5BFC;&#x901A;&#x7535;&#x963B;&#x4E3A;2&#x3A9;&#xFF0C;&#x5BFC;&#x901A;&#x540E;&#x7684;&#x6700;&#x5927;&#x7535;&#x6D41;&#x4E3A;200 mA&#x3002;&#x7535;&#x6E90;&#x7AEF;&#x9644;&#x8FD1;&#x4F9D;&#x7136;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x65C1;&#x8DEF;&#x7535;&#x5BB9;&#x3002;</p>
<h3 id="PCB&#x8BBE;&#x8BA1;">PCB&#x8BBE;&#x8BA1;</h3>
<p>&#x7531;&#x4E8E;&#x5B50;&#x677F;&#x7684;&#x5143;&#x4EF6;&#x6570;&#x91CF;&#x8F83;&#x5C11;&#x3001;&#x7535;&#x8DEF;&#x7ED3;&#x6784;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x91C7;&#x7528;&#x56DB;&#x5C42;PCB&#x677F;&#x7ED3;&#x6784;&#x3002;&#x9876;&#x5C42;&#x548C;&#x5E95;&#x5C42;&#x4E3A;&#x4FE1;&#x53F7;&#x5C42;&#xFF0C;&#x65B9;&#x4FBF;&#x7075;&#x6D3B;&#x5E03;&#x5C40;&#x548C;&#x8D70;&#x7EBF;&#xFF1B;&#x4E2D;&#x95F4;&#x4E24;&#x5C42;&#x7531;&#x4E0A;&#x81F3;&#x4E0B;&#x4F9D;&#x6B21;&#x4E3A;&#x5730;&#x5C42;&#x548C;&#x7535;&#x6E90;&#x5C42;&#x3002;&#x7535;&#x6E90;&#x5C42;&#x4E0E;&#x5730;&#x7EBF;&#x5C42;&#x5728;&#x4E2D;&#x95F4;&#x53EF;&#x4EE5;&#x8D77;&#x5230;&#x9694;&#x79BB;&#x4E24;&#x4E2A;&#x4FE1;&#x53F7;&#x5C42;&#x3001;&#x51CF;&#x5C11;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5E72;&#x6270;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<img src="/images/STCF_MDC_FEE_PCB.png" alt="STCF_MDC_FEE_PCB" title="STCF_MDC_FEE_PCB" width="1000">
<p>&#x5728;Allegro PCB Editor&#x4E2D;&#x8BBE;&#x8BA1;&#x5B8C;&#x6210;&#x7684;PCB&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x3002;&#x56FE;&#x4E2D;&#x4EC5;&#x663E;&#x793A;&#x4FE1;&#x53F7;&#x5C42;&#xFF0C;&#x7EA2;&#x8272;&#x4E3A;&#x9876;&#x5C42;&#xFF0C;&#x84DD;&#x8272;&#x4E3A;&#x5E95;&#x5C42;&#xFF0C;&#x4E24;&#x4E2A;&#x4FE1;&#x53F7;&#x5C42;&#x90FD;&#x94FA;&#x4E0A;&#x4E86;&#x63A5;&#x5730;&#x7684;&#x94DC;&#x76AE;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x7535;&#x8DEF;&#x5C4F;&#x853D;&#x6027;&#x80FD;&#x3002;&#x77E9;&#x5F62;PCB&#x7684;&#x5927;&#x5C0F;&#x4E3A;2500mil * 2800mil (&#x7EA6;63.5mm * 71.1mm)&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x672C;&#x6587;&#x8BBE;&#x8BA1;&#x4E86;STCF MDC&#x63A2;&#x6D4B;&#x5668;&#x8BFB;&#x51FA;&#x7535;&#x5B50;&#x5B66;&#x6A21;&#x62DF;&#x5B50;&#x677F;&#x7684;&#x539F;&#x7406;&#x56FE;&#x548C;PCB&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x5236;&#x677F;&#x3001;&#x710A;&#x63A5;&#x548C;&#x521D;&#x6B65;&#x6D4B;&#x8BD5;&#xFF0C;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x4E0E;&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x8054;&#x5408;&#x6D4B;&#x8BD5;&#x3002;&#x5728;&#x672C;&#x5DE5;&#x4F5C;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x63A2;&#x6D4B;&#x5668;&#x7684;&#x6700;&#x65B0;&#x9700;&#x6C42;&#xFF0C;&#x8FDB;&#x884C;&#x66F4;&#x5B8C;&#x5584;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x5F00;&#x5C55;&#x4E0E;&#x540E;&#x7AEF;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x7684;&#x8054;&#x5408;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<p><a target="_blank" rel="noopener" href="http://www.wuli.ac.cn/cn/article/doi/10.7693/wl20200803">&#x4E2D;&#x56FD;&#x8D85;&#x7EA7;&#x9676;&#x7CB2;&#x88C5;&#x7F6E;</a></p>
<p><a target="_blank" rel="noopener" href="https://arxiv.org/abs/2303.15790">STCF Conceptual Design Report: Volume 1&#x2013;Physics</a></p>

    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/zh-cn/tags/%E7%89%A9%E7%90%86%E7%94%B5%E5%AD%90%E5%AD%A6/">#物理电子学</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/zh-cn/tags/%E8%AF%BB%E5%87%BA%E7%94%B5%E5%AD%90%E5%AD%A6/">#读出电子学</a></span>
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/zh-cn/tags/STCF%E9%A1%B9%E7%9B%AE/">#STCF项目</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/zh-cn/Sep-2023/">2023年9月</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='https://platform-api.sharethis.com/js/sharethis.js#property=63b7aca8a1c9f30019b28e79&amp;product=inline-share-buttons' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'https://mengisok.github.io/zh-cn/Design-of-STCF-MDC-FEE/';
        this.page.identifier = 'zh-cn/Design-of-STCF-MDC-FEE/';
        
        this.language = 'zh';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'mengisok' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a target="_blank" rel="noopener" href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                Go forward. Don&#39;t look back. &nbsp;
                <!-- &copy; 2023 Han Meng&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        target="_blank" rel="noopener" href="http://github.com/ppoffice/hexo-theme-minos">Minos</a> -->
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <!-- 
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu" style="top:100%">
            <div class="dropdown-content">
            
                <a href="/Design-of-STCF-MDC-FEE/" class="dropdown-item">
                    English
                </a>
            
                <a href="/zh-cn/Design-of-STCF-MDC-FEE/" class="dropdown-item">
                    简体中文
                </a>
            
            </div>
        </div>
    </div>
</div>
 -->
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" target="_blank" rel="noopener" href="http://outdatedbrowser.com/">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/katex.min.css" integrity="sha384-9eLZqc9ds8eNjO3TmqPeYcDj8n+Qfa4nuSiGYa6DjLNcv9BtN69ZIulL9+8CqC9Y" crossorigin="anonymous">
<script defer src="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/katex.min.js" integrity="sha384-K3vbOmF2BtaVai+Qk37uypf7VrgBubhQreNQe9aGsz9lB63dIFiQVlJbr92dw2Lx" crossorigin="anonymous"></script>
<script defer src="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/contrib/auto-render.min.js" integrity="sha384-kmZOZB5ObwgQnS/DuDg6TScgOiWWBiVt0plIRkZCmE6rDZGrEOQeHM5PcHi+nyqe" crossorigin="anonymous"
        onload="renderMathInElement(document.body);"></script>

<script>
document.addEventListener("DOMContentLoaded", function() {
    renderMathInElement(document.body, {
        // ...options...
    });
});
</script>

    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery > p > .gallery-item').unwrap();
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索" />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.zh-cn.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
<script src="/live2dw/lib/L2Dwidget.min.js?094cbace49a39548bed64abff5988b05"></script><script>L2Dwidget.init({"pluginRootPath":"live2dw/","pluginJsPath":"lib/","pluginModelPath":"assets/","tagMode":false,"debug":false,"model":{"jsonPath":"/live2dw/assets/assets/hijiki.model.json"},"display":{"superSample":2,"width":150,"height":300,"position":"right","hOffset":0,"vOffset":-20},"mobile":{"show":true,"scale":0.5},"react":{"opacityDefault":0.7,"opacityOnHover":0.2},"log":false});</script></body>
</html>